
## :x: Apply Failed

[CI link](https://github.com/mongulu-cm/mtchoun-mouh/actions/runs/4470989319)



<pre><code>Error: Error validating S3 bucket name: only lowercase alphanumeric characters and hyphens allowed in &#34;check_liveness_after_site_deployment-djansang&#34;

  with aws_s3_bucket.images,
  on main.tf line 1, in resource &#34;aws_s3_bucket&#34; &#34;images&#34;:
   1: resource &#34;aws_s3_bucket&#34; &#34;images&#34; {


Error: Error validating S3 bucket name: only lowercase alphanumeric characters and hyphens allowed in &#34;check_liveness_after_site_deployment-mtchoun-mouh.mongulu.cm&#34;

  with aws_s3_bucket.website,
  on main.tf line 27, in resource &#34;aws_s3_bucket&#34; &#34;website&#34;:
  27: resource &#34;aws_s3_bucket&#34; &#34;website&#34; {

::debug::Terraform exited with code 1.
::debug::stdout: data.archive_file.lambda_zip: Reading...%0Adata.archive_file.lambda_zip: Read complete after 0s [id=ee48131320212cb82aff0641d2438851dc364b80]%0Aaws_dynamodb_table.Register: Refreshing state... [id=check_liveness_after_site_deployment-Register]%0Adata.aws_caller_identity.current: Reading...%0Aaws_api_gateway_rest_api.api: Refreshing state... [id=w1xhimfrng]%0Adata.aws_iam_role.role: Reading...%0Adata.aws_iam_policy_document.override: Reading...%0Aaws_cloudwatch_event_rule.scheduler: Refreshing state... [id=check_liveness_after_site_deployment-trigger_user_scan]%0Aaws_dynamodb_table.Link_table: Refreshing state... [id=check_liveness_after_site_deployment-Link_table]%0Adata.aws_iam_policy_document.override: Read complete after 0s [id=335005607]%0Aaws_dynamodb_table.Users: Refreshing state... [id=check_liveness_after_site_deployment-Users]%0Adata.aws_caller_identity.current: Read complete after 0s [id=053932140667]%0Adata.aws_iam_role.role: Read complete after 0s [id=website-deployer]%0Aaws_lambda_function.scan: Refreshing state... [id=check_liveness_after_site_deployment-scan_user_consulcam]%0Aaws_lambda_function.lambda: Refreshing state... [id=check_liveness_after_site_deployment-user_registration_consulcam]%0Aaws_api_gateway_resource.resource: Refreshing state... [id=k688vp]%0Aaws_api_gateway_method.method: Refreshing state... [id=agm-w1xhimfrng-k688vp-POST]%0Amodule.cors.aws_api_gateway_method._: Refreshing state... [id=agm-w1xhimfrng-k688vp-OPTIONS]%0Aaws_lambda_permission.allow_cloudwatch_to_call_check_foo: Refreshing state... [id=AllowExecutionFromCloudWatch]%0Aaws_cloudwatch_event_target.target: Refreshing state... [id=check_liveness_after_site_deployment-trigger_user_scan-lambda]%0Amodule.cors.aws_api_gateway_method_response._: Refreshing state... [id=agmr-w1xhimfrng-k688vp-OPTIONS-200]%0Aaws_lambda_permission.apigw_lambda: Refreshing state... [id=AllowExecutionFromAPIGateway]%0Amodule.cors.aws_api_gateway_integration._: Refreshing state... [id=agi-w1xhimfrng-k688vp-OPTIONS]%0Aaws_api_gateway_method_response.method_response_200: Refreshing state... [id=agmr-w1xhimfrng-k688vp-POST-200]%0Aaws_api_gateway_integration.integration: Refreshing state... [id=agi-w1xhimfrng-k688vp-POST]%0Aaws_api_gateway_deployment.test: Refreshing state... [id=8ktaba]%0Amodule.cors.aws_api_gateway_integration_response._: Refreshing state... [id=agir-w1xhimfrng-k688vp-OPTIONS-200]%0Alocal_file.demo_page: Refreshing state... [id=cb50a1ca1de030f95cf39d7d10977ca658b16d16]%0Alocal_file.index_page: Refreshing state... [id=21584e76cf52557980c88be800828f84923a1b2d]%0A%0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  &#43; create%0A  ~ update in-place%0A%0ATerraform will perform the following actions:%0A%0A  # aws_lambda_function.lambda will be updated in-place%0A  ~ resource &#34;aws_lambda_function&#34; &#34;lambda&#34; {%0A        id                             = &#34;check_liveness_after_site_deployment-user_registration_consulcam&#34;%0A      ~ last_modified                  = &#34;2023-03-20T16:59:55.000&#43;0000&#34; -&gt; (known after apply)%0A      ~ source_code_hash               = &#34;h3/&#43;PKoQaqFl2h90TU3JrzhYnEl1fb5Xe1A5T1eW1sY=&#34; -&gt; &#34;nh759jHoU7SJBsYm14XG5cjr0zauYDnuWJJp2mVxvAY=&#34;%0A        tags                           = {%0A            &#34;environment&#34; = &#34;master&#34;%0A            &#34;project&#34;     = &#34;mtchoun-mouh&#34;%0A        }%0A        # (17 unchanged attributes hidden)%0A%0A        # (2 unchanged blocks hidden)%0A    }%0A%0A  # aws_lambda_function.scan will be updated in-place%0A  ~ resource &#34;aws_lambda_function&#34; &#34;scan&#34; {%0A        id                             = &#34;check_liveness_after_site_deployment-scan_user_consulcam&#34;%0A      ~ last_modified                  = &#34;2023-03-20T16:59:58.000&#43;0000&#34; -&gt; (known after apply)%0A      ~ source_code_hash               = &#34;h3/&#43;PKoQaqFl2h90TU3JrzhYnEl1fb5Xe1A5T1eW1sY=&#34; -&gt; &#34;nh759jHoU7SJBsYm14XG5cjr0zauYDnuWJJp2mVxvAY=&#34;%0A        tags                           = {%0A            &#34;environment&#34; = &#34;master&#34;%0A            &#34;project&#34;     = &#34;mtchoun-mouh&#34;%0A        }%0A        # (17 unchanged attributes hidden)%0A%0A        # (2 unchanged blocks hidden)%0A    }%0A%0A  # aws_s3_bucket.images will be created%0A  &#43; resource &#34;aws_s3_bucket&#34; &#34;images&#34; {%0A      &#43; acceleration_status         = (known after apply)%0A      &#43; acl                         = &#34;private&#34;%0A      &#43; arn                         = (known after apply)%0A      &#43; bucket                      = &#34;check_liveness_after_site_deployment-djansang&#34;%0A      &#43; bucket_domain_name          = (known after apply)%0A      &#43; bucket_regional_domain_name = (known after apply)%0A      &#43; force_destroy               = true%0A      &#43; hosted_zone_id              = (known after apply)%0A      &#43; id                          = (known after apply)%0A      &#43; region                      = (known after apply)%0A      &#43; request_payer               = (known after apply)%0A      &#43; tags                        = {%0A          &#43; &#34;Name&#34;        = &#34;images&#34;%0A          &#43; &#34;environment&#34; = &#34;master&#34;%0A          &#43; &#34;project&#34;     = &#34;mtchoun-mouh&#34;%0A        }%0A      &#43; tags_all                    = {%0A          &#43; &#34;Name&#34;        = &#34;images&#34;%0A          &#43; &#34;environment&#34; = &#34;master&#34;%0A          &#43; &#34;project&#34;     = &#34;mtchoun-mouh&#34;%0A        }%0A      &#43; website_domain              = (known after apply)%0A      &#43; website_endpoint            = (known after apply)%0A    }%0A%0A  # aws_s3_bucket.website will be created%0A  &#43; resource &#34;aws_s3_bucket&#34; &#34;website&#34; {%0A      &#43; acceleration_status         = (known after apply)%0A      &#43; acl                         = &#34;public-read&#34;%0A      &#43; arn                         = (known after apply)%0A      &#43; bucket                      = &#34;check_liveness_after_site_deployment-mtchoun-mouh.mongulu.cm&#34;%0A      &#43; bucket_domain_name          = (known after apply)%0A      &#43; bucket_regional_domain_name = (known after apply)%0A      &#43; force_destroy               = true%0A      &#43; hosted_zone_id              = (known after apply)%0A      &#43; id                          = (known after apply)%0A      &#43; policy                      = jsonencode(%0A            {%0A              &#43; Statement = [%0A                  &#43; {%0A                      &#43; Action    = &#34;s3:GetObject&#34;%0A                      &#43; Effect    = &#34;Allow&#34;%0A                      &#43; Principal = {%0A                          &#43; &#34;*&#34; = &#34;AWS&#34;%0A                        }%0A                      &#43; Resource  = &#34;arn:aws:s3:::check_liveness_after_site_deployment-mtchoun-mouh.mongulu.cm/*&#34;%0A                      &#43; Sid       = &#34;PublicReadForGetBucketObjects&#34;%0A                    },%0A                ]%0A              &#43; Version   = &#34;2012-10-17&#34;%0A            }%0A        )%0A      &#43; region                      = (known after apply)%0A      &#43; request_payer               = (known after apply)%0A      &#43; tags                        = {%0A          &#43; &#34;Name&#34;        = &#34;Website&#34;%0A          &#43; &#34;environment&#34; = &#34;master&#34;%0A          &#43; &#34;project&#34;     = &#34;mtchoun-mouh&#34;%0A        }%0A      &#43; tags_all                    = {%0A          &#43; &#34;Name&#34;        = &#34;Website&#34;%0A          &#43; &#34;environment&#34; = &#34;master&#34;%0A          &#43; &#34;project&#34;     = &#34;mtchoun-mouh&#34;%0A        }%0A      &#43; website_domain              = (known after apply)%0A      &#43; website_endpoint            = (known after apply)%0A%0A      &#43; cors_rule {%0A          &#43; allowed_headers = [%0A              &#43; &#34;*&#34;,%0A            ]%0A          &#43; allowed_methods = [%0A              &#43; &#34;PUT&#34;,%0A              &#43; &#34;POST&#34;,%0A              &#43; &#34;GET&#34;,%0A            ]%0A          &#43; allowed_origins = [%0A              &#43; &#34;*&#34;,%0A            ]%0A        }%0A%0A      &#43; website {%0A          &#43; error_document = &#34;error.html&#34;%0A          &#43; index_document = &#34;index.html&#34;%0A        }%0A    }%0A%0A  # local_file.demo_page will be created%0A  &#43; resource &#34;local_file&#34; &#34;demo_page&#34; {%0A      &#43; content              = &lt;&lt;-EOT%0A            &lt;!DOCTYPE html&gt;%0A            &lt;html lang=&#34;en&#34;&gt;%0A              &lt;head&gt;%0A                &lt;meta charset=&#34;UTF-8&#34; /&gt;%0A                &lt;meta name=&#34;viewport&#34; content=&#34;width=device-width,initial-scale=1.0&#34; /&gt;%0A                &lt;meta name=&#34;description&#34; content=&#34;Recevez une notification dès la sortie de votre passeport sans prise de tête :)&#34;/&gt;%0A                &lt;script src=&#34;https://code.jquery.com/jquery-3.3.1.min.js&#34;&gt;&lt;/script&gt;%0A                &lt;script%0A                  src=&#34;https://cdn.jsdelivr.net/npm/popper.js@1.16.1/dist/umd/popper.min.js&#34;%0A                  integrity=&#34;sha384-9/reFTGAW83EW2RDu2S0VKaIzap3H66lZH81PoYlFhbGU&#43;6BZp6G7niu735Sk7lN&#34;%0A                  crossorigin=&#34;anonymous&#34;%0A                &gt;&lt;/script&gt;%0A                &lt;script%0A                  src=&#34;https://cdn.jsdelivr.net/npm/bootstrap@4.5.3/dist/js/bootstrap.min.js&#34;%0A                  integrity=&#34;sha384-w1Q4orYjBQndcko6MimVbzY0tgp4pWB4lZ7lr30WKz0vr/aWKhXdBNmNb5D92v7s&#34;%0A                  crossorigin=&#34;anonymous&#34;%0A                &gt;&lt;/script&gt;%0A                &lt;link%0A                  rel=&#34;stylesheet&#34;%0A                  href=&#34;https://stackpath.bootstrapcdn.com/bootstrap/4.5.2/css/bootstrap.min.css&#34;%0A                  integrity=&#34;sha384-JcKb8q3iqJ61gNV9KGb8thSsNjpSL0n8PARn9HuZOnIxN0hoP&#43;VmmDGMN5t9UJ0Z&#34;%0A                  crossorigin=&#34;anonymous&#34;%0A                /&gt;%0A                &lt;link rel=&#34;stylesheet&#34; href=&#34;style.css&#34; /&gt;%0A                &lt;title&gt;Mtchoun&#39; mouh&lt;/title&gt;%0A                &lt;!-- jQuery Modal --&gt;%0A                &lt;script src=&#34;https://cdnjs.cloudflare.com/ajax/libs/jquery-modal/0.9.1/jquery.modal.min.js&#34;&gt;&lt;/script&gt;%0A                &lt;link%0A                  rel=&#34;stylesheet&#34;%0A                  href=&#34;https://cdnjs.cloudflare.com/ajax/libs/jquery-modal/0.9.1/jquery.modal.min.css&#34;%0A                /&gt;%0A                &lt;script type=&#34;text/javascript&#34;&gt;%0A                  $(function () {%0A                    $(&#34;#help&#34;).popover({%0A                      trigger: &#34;focus&#34;,%0A                    });%0A                  });%0A            %0A                  // disable onPaste%0A                  function disablePaste(e) {%0A                    return false;%0A                  }%0A                  // validate data%0A                  function controlFormData(e) {%0A                    e.preventDefault();%0A                    var Namere = /[A-Za-z]{1}[A-Za-z]/;%0A                    if (!Namere.test($(&#34;#name-input&#34;).val())) {%0A                      //alert(&#34;Name can not less than 2 char&#34;);%0A                      $(&#34;#errorMessage&gt;p&#34;).html(&#34;Le nom ne peut avoir moins de 2 caractères!&#34;);%0A                      $(&#34;#errorMessage&#34;).modal(&#34;show&#34;);%0A                      return;%0A                    }%0A            %0A                    $(&#34;#confirmationModal&#34;).modal(&#34;show&#34;);%0A                  }%0A            %0A                  function submitToAPI(e) {%0A                    e.preventDefault();%0A                    var URL = &#34;https://w1xhimfrng.execute-api.eu-central-1.amazonaws.com/check_liveness_after_site_deployment-dev/register&#34;;%0A            %0A                    var name = $(&#34;#name-input&#34;).val();%0A                    var data = {%0A                      name: name,%0A                    };%0A            %0A                    $.ajax({%0A                      type: &#34;POST&#34;,%0A                      url: URL,%0A                      dataType: &#34;json&#34;,%0A                      crossDomain: &#34;true&#34;,%0A                      contentType: &#34;application/json; charset=utf-8&#34;,%0A                      data: JSON.stringify(data),%0A            %0A                      success: function (response) {%0A                        // clear form and show a success message%0A                        $(&#34;#errorMessage&gt;p&#34;).html(%0A                          &#34;Nous avons  trouvé l &lt;a href=&#34;&#43;response[&#34;message&#34;]&#43;&#34;&gt;image&lt;/a&gt; d&#39;où provient votre choix &amp;#128578;&#34;%0A            %0A                        );%0A                        $(&#34;#errorMessage&#34;).css(&#34;background&#34;, &#34;#0f7555&#34;);%0A                        console.log(&#34;ok&#34;)%0A                        $(&#34;#errorMessage&#34;).modal(&#34;show&#34;);%0A                        document.getElementById(&#34;contact-form&#34;).reset();%0A                        //location.reload();%0A                      },%0A                      error: function () {%0A                        // show an error message%0A                        $(&#34;#errorMessage&gt;p&#34;).html(%0A                          &#34;Le nom rentré n&#39;existe pas. \n Veuillez vérifier l&#39;orthographe. &#34;%0A                        );%0A                        $(&#34;#errorMessage&#34;).modal(&#34;show&#34;);%0A                        //location.reload();%0A                      },%0A                    });%0A                  }%0A                &lt;/script&gt;%0A              &lt;/head&gt;%0A              &lt;body class=&#34;text-center&#34;&gt;%0A                &lt;!--https://aws.amazon.com/fr/blogs/architecture/create-dynamic-contact-forms-for-s3-static-websites-using-aws-lambda-amazon-api-gateway-and-amazon-ses/--&gt;%0A                &lt;form id=&#34;contact-form&#34; method=&#34;post&#34; class=&#34;form-signin&#34;&gt;%0A                  &lt;div class=&#34;mb-2&#34;&gt;%0A                    &lt;img alt=&#34;Logo cameroun&#34; width=&#34;150&#34; src=&#34;Armoiries_cameroun.svg&#34; /&gt;%0A                  &lt;/div&gt;%0A                  &lt;h1 class=&#34;h5 font-weight-normal highlight&#34;&gt;Si vous êtes là c&#39;est que vous voulez une démonstration. Pas de soucis &amp;#128578; &lt;/h1&gt;%0A                  &lt;h2 class=&#34;h6 font-weight-normal highlight&#34;&gt;Nous vous proposons donc de choisir un nom au hasard dans le &lt;b&gt;communiqué du 22/09/2020&lt;/b&gt;.%0A                      Pour cela rien de plus simple: rendez vous juste sur la page du &lt;a href=&#34;https://www.consulacam-marseille.fr/index.php?p=consulat-cameroun-passeports&#34;&gt;consulat&lt;/a&gt;%0A                      et entrez ci-dessous celui-ci choisi.%0A                  &lt;/h2&gt;%0A                  &lt;b&gt;NOTEZ BIEN &lt;/b&gt;%0A                  &lt;svg%0A                    data-html=&#34;true&#34;%0A                    tabindex=&#34;0&#34;%0A                    id=&#34;help&#34;%0A                    data-toggle=&#34;popover&#34;%0A                    data-trigger=&#34;focus&#34;%0A                    title=&#34;Important !&#34;%0A                    data-content=&#34;&lt;p&gt;Le nom doit être écrit pareil et dans le même ordre que celui choisi dans la page du consulat&lt;/p&gt;%0A                                  &lt;p&gt;Liste des contraintes actuelles (vérifiez que vous n&#39;entrez pas dans ces cas) qui ne sont pas supportés: &lt;/p&gt;%0A                                  &lt;ol&gt;%0A                                    &lt;li&gt;Les noms comprenant le mot &lt;b&gt;vve&lt;/b&gt;&lt;/li&gt;%0A                                    &lt;li&gt;Les noms comprenant les accents circonflexes comme Benoît&lt;/li&gt;%0A                                    &lt;li&gt;Les noms comprenant les trémas comme Raïssa&lt;/li&gt;%0A                                    &lt;li&gt;Les noms comprenant qu&#39;un seul mot &lt;/li&gt;%0A                                    &lt;li&gt;Les noms comprenant un mot se terminant par i comme Etoundi &lt;/li&gt;%0A                                    &lt;li&gt;Les noms comprenant des chiffres romains&lt;/li&gt;%0A                                  &lt;/ol&gt;&#34;%0A                    aria-hidden=&#34;true&#34;%0A                    focusable=&#34;false&#34;%0A                    data-prefix=&#34;fas&#34;%0A                    data-icon=&#34;info-circle&#34;%0A                    class=&#34;svg-inline--fa fa-info-circle fa-w-16&#34;%0A                    role=&#34;img&#34;%0A                    xmlns=&#34;http://www.w3.org/2000/svg&#34;%0A                    viewBox=&#34;0 0 512 512&#34;%0A                  &gt;%0A                    &lt;path%0A                      fill=&#34;currentColor&#34;%0A                      d=&#34;M256 8C119.043 8 8 119.083 8 256c0 136.997 111.043 248 248 248s248-111.003 248-248C504 119.083 392.957 8 256 8zm0 110c23.196 0 42 18.804 42 42s-18.804 42-42 42-42-18.804-42-42 18.804-42 42-42zm56 254c0 6.627-5.373 12-12 12h-88c-6.627 0-12-5.373-12-12v-24c0-6.627 5.373-12 12-12h12v-64h-12c-6.627 0-12-5.373-12-12v-24c0-6.627 5.373-12 12-12h64c6.627 0 12 5.373 12 12v100h12c6.627 0 12 5.373 12 12v24z&#34;%0A                    &gt;&lt;/path&gt;%0A                  &lt;/svg&gt;%0A                  &lt;label for=&#34;input-name&#34; class=&#34;sr-only&#34;&gt;Name:&lt;/label&gt;%0A                  &lt;input%0A                    type=&#34;text&#34;%0A                    id=&#34;name-input&#34;%0A                    placeholder=&#34;Veuillez le nom choisi …&#34;%0A                    style=&#34;text-transform: uppercase&#34;%0A                    class=&#34;form-control&#34;%0A                  /&gt;%0A                  &lt;div%0A                    class=&#34;g-recaptcha&#34;%0A                    data-sitekey=&#34;6Lc7cVMUAAAAAM1yxf64wrmO8gvi8A1oQ_ead1ys&#34;%0A                  &gt;&lt;/div&gt;%0A            %0A                  &lt;button%0A                    class=&#34;btn btn-lg btn-primary btn-block&#34;%0A                    type=&#34;button&#34;%0A                    onClick=&#34;submitToAPI(event)&#34;%0A                  &gt;%0A                    Submit%0A                  &lt;/button&gt;%0A            %0A                  &lt;h3 class=&#34;h6 mt-2 font-weight-normal&#34;&gt;Retournez en &lt;a href=&#34;index.html&#34;&gt;page d&#39;accueil &lt;/a&gt; &lt;/h3&gt;%0A            %0A                  &lt;div class=&#34;mt-5&#34;&gt;%0A                    &lt;img alt=&#34;Logo cameroun&#34; width=&#34;150&#34; src=&#34;Armoiries_de_Marseille.svg&#34; /&gt;%0A                  &lt;/div&gt;%0A                  &lt;p class=&#34;mt-3 mb-3 text-muted&#34;&gt;&amp;copy; 2020 - &lt;a href=&#34;mailto: mtchoun-mouh.517d52500895ecc79cf4b19d5745e1c3.show-sender@streams.zulipchat.com&#34;&gt;Contact&lt;/a&gt;&lt;/p&gt;%0A                &lt;/form&gt;%0A            %0A                &lt;!-- Alert-error --&gt;%0A                &lt;div id=&#34;errorMessage&#34; class=&#34;modal&#34;&gt;%0A                  &lt;p&gt;Content error&lt;/p&gt;%0A                &lt;/div&gt;%0A              &lt;/body&gt;%0A            &lt;/html&gt;%0A        EOT%0A      &#43; content_base64sha256 = (known after apply)%0A      &#43; content_base64sha512 = (known after apply)%0A      &#43; content_md5          = (known after apply)%0A      &#43; content_sha1         = (known after apply)%0A      &#43; content_sha256       = (known after apply)%0A      &#43; content_sha512       = (known after apply)%0A      &#43; directory_permission = &#34;0777&#34;%0A      &#43; file_permission      = &#34;0777&#34;%0A      &#43; filename             = &#34;../html/demo.html&#34;%0A      &#43; id                   = (known after apply)%0A    }%0A%0A  # local_file.index_page will be created%0A  &#43; resource &#34;local_file&#34; &#34;index_page&#34; {%0A      &#43; content              = &lt;&lt;-EOT%0A            &lt;!DOCTYPE html&gt;%0A            &lt;html lang=&#34;en&#34;&gt;%0A              &lt;head&gt;%0A                &lt;meta charset=&#34;UTF-8&#34; /&gt;%0A                &lt;meta name=&#34;viewport&#34; content=&#34;width=device-width,initial-scale=1.0&#34; /&gt;%0A                &lt;meta name=&#34;description&#34; content=&#34;Recevez une notification dès la sortie de votre passeport sans prise de tête :)&#34;/&gt;%0A                &lt;script src=&#34;https://code.jquery.com/jquery-3.3.1.min.js&#34;&gt;&lt;/script&gt;%0A                &lt;script%0A                  src=&#34;https://cdn.jsdelivr.net/npm/popper.js@1.16.1/dist/umd/popper.min.js&#34;%0A                  integrity=&#34;sha384-9/reFTGAW83EW2RDu2S0VKaIzap3H66lZH81PoYlFhbGU&#43;6BZp6G7niu735Sk7lN&#34;%0A                  crossorigin=&#34;anonymous&#34;%0A                &gt;&lt;/script&gt;%0A                &lt;script%0A                  src=&#34;https://cdn.jsdelivr.net/npm/bootstrap@4.5.3/dist/js/bootstrap.min.js&#34;%0A                  integrity=&#34;sha384-w1Q4orYjBQndcko6MimVbzY0tgp4pWB4lZ7lr30WKz0vr/aWKhXdBNmNb5D92v7s&#34;%0A                  crossorigin=&#34;anonymous&#34;%0A                &gt;&lt;/script&gt;%0A                &lt;link%0A                  rel=&#34;stylesheet&#34;%0A                  href=&#34;https://stackpath.bootstrapcdn.com/bootstrap/4.5.2/css/bootstrap.min.css&#34;%0A                  integrity=&#34;sha384-JcKb8q3iqJ61gNV9KGb8thSsNjpSL0n8PARn9HuZOnIxN0hoP&#43;VmmDGMN5t9UJ0Z&#34;%0A                  crossorigin=&#34;anonymous&#34;%0A                /&gt;%0A                &lt;link rel=&#34;stylesheet&#34; href=&#34;style.css&#34; /&gt;%0A                &lt;!-- Matomo Tag Manager --&gt;%0A                &lt;script&gt;%0A                var _mtm = window._mtm = window._mtm || [];%0A                _mtm.push({&#39;mtm.startTime&#39;: (new Date().getTime()), &#39;event&#39;: &#39;mtm.Start&#39;});%0A                var d=document, g=d.createElement(&#39;script&#39;), s=d.getElementsByTagName(&#39;script&#39;)[0];%0A                g.async=true; g.src=&#39;https://matomo.mongulu.cm/js/container_mkXxNHkb.js&#39;; s.parentNode.insertBefore(g,s);%0A                &lt;/script&gt;%0A                &lt;!-- End Matomo Tag Manager --&gt;%0A                &lt;title&gt;Mtchoun&#39; mouh&lt;/title&gt;%0A                &lt;!-- jQuery Modal --&gt;%0A                &lt;script src=&#34;https://cdnjs.cloudflare.com/ajax/libs/jquery-modal/0.9.1/jquery.modal.min.js&#34;&gt;&lt;/script&gt;%0A                &lt;link%0A                  rel=&#34;stylesheet&#34;%0A                  href=&#34;https://cdnjs.cloudflare.com/ajax/libs/jquery-modal/0.9.1/jquery.modal.min.css&#34;%0A                /&gt;%0A                &lt;script type=&#34;text/javascript&#34;&gt;%0A                  $(function () {%0A                    $(&#34;#help&#34;).popover({%0A                      trigger: &#34;focus&#34;,%0A                    });%0A                  });%0A                  $(function () {%0A                    $(&#34;#help2&#34;).popover({%0A                      trigger: &#34;focus&#34;,%0A                    });%0A                  });%0A                  // disable onPaste%0A                  function disablePaste(e) {%0A                    return false;%0A                  }%0A                  // validate data%0A                  function controlFormData(e) {%0A                    e.preventDefault();%0A                    var Namere = /[A-Za-z]{1}[A-Za-z]/;%0A                    if (!Namere.test($(&#34;#name-input&#34;).val())) {%0A                      //alert(&#34;Name can not less than 2 char&#34;);%0A                      $(&#34;#errorMessage&gt;p&#34;).html(&#34;Le nom ne peut avoir moins de 2 caractères!&#34;);%0A                      $(&#34;#errorMessage&#34;).modal(&#34;show&#34;);%0A                      return;%0A                    }%0A                    if ($(&#34;#email-input&#34;).val() == &#34;&#34;) {%0A                      $(&#34;#errorMessage&gt;p&#34;).html(&#34;Veuillez entrer une adresse email valide!&#34;);%0A                      $(&#34;#errorMessage&#34;).modal(&#34;show&#34;);%0A                      return;%0A                    }%0A                    var reeamil = /^([\w-\.]&#43;@([\w-]&#43;\.)&#43;[\w-]{2,6})?$/;%0A                    if (!reeamil.test($(&#34;#email-input&#34;).val())) {%0A                      $(&#34;#errorMessage&gt;p&#34;).html(&#34;Veuillez entrer une adresse email valide!&#34;);%0A                      $(&#34;#errorMessage&#34;).modal(&#34;show&#34;);%0A                      return;%0A                    }%0A            %0A                    $(&#34;#confirmationName&#34;).val($(&#34;#name-input&#34;).val());%0A                    $(&#34;#confirmationEmail&#34;).val($(&#34;#email-input&#34;).val());%0A                    $(&#34;#confirmationModal&#34;).modal(&#34;show&#34;);%0A                  }%0A            %0A                  function submitToAPI(e) {%0A                    e.preventDefault();%0A                    var URL = &#34;https://w1xhimfrng.execute-api.eu-central-1.amazonaws.com/check_liveness_after_site_deployment-dev/register&#34;;%0A            %0A                    if ($(&#34;#name-input&#34;).val() != $(&#34;#confirmationName&#34;).val()) {%0A                      $(&#34;#feedbackName&#34;).html(&#34;Votre nom ne correspond pas!&#34;);%0A                      $(&#34;#feedbackName&#34;).css(&#34;display&#34;, &#34;block&#34;);%0A                      return;%0A                    }%0A                    if ($(&#34;#email-input&#34;).val() != $(&#34;#confirmationEmail&#34;).val()) {%0A                      $(&#34;#feedbackEmail&#34;).html(&#34;Votre adresse mail ne correspond pas!&#34;);%0A                      $(&#34;#feedbackEmail&#34;).css(&#34;display&#34;, &#34;block&#34;);%0A                      return;%0A                    }%0A            %0A                    var name = $(&#34;#name-input&#34;).val();%0A                    var email = $(&#34;#email-input&#34;).val();%0A                    var data = {%0A                      name: name,%0A                      email: email,%0A                    };%0A            %0A                    $.ajax({%0A                      type: &#34;POST&#34;,%0A                      url: URL,%0A                      dataType: &#34;json&#34;,%0A                      crossDomain: &#34;true&#34;,%0A                      contentType: &#34;application/json; charset=utf-8&#34;,%0A                      data: JSON.stringify(data),%0A            %0A                      success: function () {%0A                        // clear form and show a success message%0A                        $(&#34;#errorMessage&gt;p&#34;).html(%0A                          &#34;Consultez votre email. Un lien de confirmation vous a été envoyé.&#34;%0A                        );%0A                        $(&#34;#errorMessage&#34;).css(&#34;background&#34;, &#34;#0f7555&#34;);%0A                        $(&#34;#errorMessage&#34;).modal(&#34;show&#34;);%0A                        document.getElementById(&#34;contact-form&#34;).reset();%0A                        //location.reload();%0A                      },%0A                      error: function () {%0A                        // show an error message%0A                        $(&#34;#errorMessage&gt;p&#34;).html(%0A                          &#34;Nous n&#39;avons malhreusement pas pu vous enregistrer. Veuillez contacter l&#39;&lt;a href=\&#34;mailto: mtchoun-mouh.517d52500895ecc79cf4b19d5745e1c3.show-sender@streams.zulipchat.com\&#34;&gt;administrateur &lt;/a&gt;. &#34;%0A                        );%0A                        $(&#34;#errorMessage&#34;).modal(&#34;show&#34;);%0A                        location.reload();%0A                      },%0A                    });%0A                  }%0A                &lt;/script&gt;%0A              &lt;/head&gt;%0A            %0A              &lt;body class=&#34;text-center&#34;&gt;%0A                &lt;!--https://aws.amazon.com/fr/blogs/architecture/create-dynamic-contact-forms-for-s3-static-websites-using-aws-lambda-amazon-api-gateway-and-amazon-ses/--&gt;%0A                &lt;form id=&#34;contact-form&#34; method=&#34;post&#34; class=&#34;form-signin&#34;&gt;%0A                  &lt;div class=&#34;mb-2&#34;&gt;%0A                    &lt;img alt=&#34;Logo cameroun&#34; width=&#34;150&#34; src=&#34;Armoiries_cameroun.svg&#34; /&gt;%0A                  &lt;/div&gt;%0A                  &lt;h1 class=&#34;h5 font-weight-normal highlight&#34;&gt;Vous venez de déposer votre passeport au consulat de Marseille ?&lt;/h1&gt;%0A                  &lt;h2 class=&#34;h5 font-weight-normal highlight&#34;&gt;On vous a dit regarder le site régulièrement et vous avez déjà trop de choses en tête &amp;#128533;?&lt;/h2&gt;%0A                  &lt;h2 class=&#34;h6 font-weight-normal&#34;&gt;Nous pouvons vous aider en vous notifiant dès sa sortie &amp;#128526;.&lt;/h2&gt;%0A                  &lt;h3 class=&#34;h6 font-weight-normal&#34;&gt;Pour cela rien de plus simple: Rentrez ici les informations requises*&lt;/h3&gt;%0A                  &lt;b&gt;NOTEZ BIEN &lt;/b&gt;%0A                  &lt;svg%0A                    data-html=&#34;true&#34;%0A                    tabindex=&#34;0&#34;%0A                    id=&#34;help&#34;%0A                    data-toggle=&#34;popover&#34;%0A                    data-trigger=&#34;focus&#34;%0A                    title=&#34;Important !&#34;%0A                    data-content=&#34;&lt;p&gt;Le nom doit être écrit pareil et dans le même ordre que commnuniqué au consulat&lt;/p&gt;%0A                                  &lt;p&gt;Liste des contraintes actuelles (vérifiez que vous n&#39;entrez pas dans ces cas) qui ne sont pas supportés: &lt;/p&gt;%0A                                  &lt;ol&gt;%0A                                    &lt;li&gt;Les noms comprenant le mot &lt;b&gt;vve&lt;/b&gt;&lt;/li&gt;%0A                                    &lt;li&gt;Les noms comprenant les accents circonflexes comme Benoît&lt;/li&gt;%0A                                    &lt;li&gt;Les noms comprenant les trémas comme Raïssa&lt;/li&gt;%0A                                    &lt;li&gt;Les noms comprenant qu&#39;un seul mot &lt;/li&gt;%0A                                    &lt;li&gt;Les noms comprenant un mot se terminant par i comme Etoundi &lt;/li&gt;%0A                                    &lt;li&gt;Les noms comprenant des chiffres romains&lt;/li&gt;%0A                                  &lt;/ol&gt;&#34;%0A                    aria-hidden=&#34;true&#34;%0A                    focusable=&#34;false&#34;%0A                    data-prefix=&#34;fas&#34;%0A                    data-icon=&#34;info-circle&#34;%0A                    class=&#34;svg-inline--fa fa-info-circle fa-w-16&#34;%0A                    role=&#34;img&#34;%0A                    xmlns=&#34;http://www.w3.org/2000/svg&#34;%0A                    viewBox=&#34;0 0 512 512&#34;%0A                  &gt;%0A                    &lt;path%0A                      fill=&#34;currentColor&#34;%0A                      d=&#34;M256 8C119.043 8 8 119.083 8 256c0 136.997 111.043 248 248 248s248-111.003 248-248C504 119.083 392.957 8 256 8zm0 110c23.196 0 42 18.804 42 42s-18.804 42-42 42-42-18.804-42-42 18.804-42 42-42zm56 254c0 6.627-5.373 12-12 12h-88c-6.627 0-12-5.373-12-12v-24c0-6.627 5.373-12 12-12h12v-64h-12c-6.627 0-12-5.373-12-12v-24c0-6.627 5.373-12 12-12h64c6.627 0 12 5.373 12 12v100h12c6.627 0 12 5.373 12 12v24z&#34;%0A                    &gt;&lt;/path&gt;%0A                  &lt;/svg&gt;%0A                  &lt;label for=&#34;input-name&#34; class=&#34;sr-only&#34;&gt;Name:&lt;/label&gt;%0A                  &lt;input%0A                    type=&#34;text&#34;%0A                    id=&#34;name-input&#34;%0A                    placeholder=&#34;Veuillez entrer votre nom …&#34;%0A                    style=&#34;text-transform: uppercase&#34;%0A                    class=&#34;form-control&#34;%0A                  /&gt;%0A                  &lt;br /&gt;%0A                  &lt;label for=&#34;inputEmail&#34; class=&#34;sr-only&#34;&gt;Email:&lt;/label&gt;%0A                  &lt;input%0A                    type=&#34;email&#34;%0A                    id=&#34;email-input&#34;%0A                    placeholder=&#34;Veuillez entrer votre adresse mail …&#34;%0A                    class=&#34;form-control&#34;%0A                  /&gt;&lt;br /&gt;%0A                  &lt;div%0A                    class=&#34;g-recaptcha&#34;%0A                    data-sitekey=&#34;6Lc7cVMUAAAAAM1yxf64wrmO8gvi8A1oQ_ead1ys&#34;%0A                  &gt;&lt;/div&gt;%0A            %0A                  &lt;!-- Link to open the modal --&gt;%0A                  &lt;a href=&#34;#confirmationButton&#34; onClick=&#34;controlFormData(event)&#34;&gt;%0A                    &lt;button class=&#34;btn btn-lg btn-primary btn-block&#34;&gt;Soumettre&lt;/button&gt;%0A                  &lt;/a&gt;%0A                  &lt;b&gt;* PROTECTION DES DONNEES &lt;/b&gt;%0A                  &lt;svg%0A                    data-html=&#34;true&#34;%0A                    tabindex=&#34;1&#34;%0A                    id=&#34;help2&#34;%0A                    data-toggle=&#34;popover&#34;%0A                    data-trigger=&#34;focus&#34;%0A                    title=&#34;Important !&#34;%0A                    data-content=&#39;&lt;p&gt; Nous nous engageons à protéger les informations personelles transmises: &lt;/p&gt;%0A                                  &lt;ol&gt;%0A                                    &lt;li&gt;Celles-ci ne seront communiqués à aucun tiers et servent uniquement à vous envoyer votre notification&lt;/li&gt;%0A                                    &lt;li&gt;Une fois la notification envoyé, vos informations sont immédiatement supprimés, nous ne les conservons pas&lt;/li&gt;%0A                                  &lt;/ol&gt;%0A                                  &lt;p&gt; Comme preuve de bonne foi, le &lt;b&gt;code source est disponible en libre accès &lt;a href=&#34;https://github.com/mongulu-cm/mtchoun-mouh&#34;&gt; ici &lt;/a&gt; &lt;/b&gt;&#39;%0A                    aria-hidden=&#34;true&#34;%0A                    focusable=&#34;false&#34;%0A                    data-prefix=&#34;fas&#34;%0A                    data-icon=&#34;info-circle&#34;%0A                    class=&#34;svg-inline--fa fa-info-circle fa-w-16&#34;%0A                    role=&#34;img&#34;%0A                    xmlns=&#34;http://www.w3.org/2000/svg&#34;%0A                    viewBox=&#34;0 0 512 512&#34;%0A                  &gt;%0A                      &lt;path%0A                        fill=&#34;currentColor&#34;%0A                        d=&#34;M256 8C119.043 8 8 119.083 8 256c0 136.997 111.043 248 248 248s248-111.003 248-248C504 119.083 392.957 8 256 8zm0 110c23.196 0 42 18.804 42 42s-18.804 42-42 42-42-18.804-42-42 18.804-42 42-42zm56 254c0 6.627-5.373 12-12 12h-88c-6.627 0-12-5.373-12-12v-24c0-6.627 5.373-12 12-12h12v-64h-12c-6.627 0-12-5.373-12-12v-24c0-6.627 5.373-12 12-12h64c6.627 0 12 5.373 12 12v100h12c6.627 0 12 5.373 12 12v24z&#34;%0A                      &gt;&lt;/path&gt;%0A                  &lt;/svg&gt;%0A            %0A                  &lt;h3 class=&#34;h6 font-weight-normal&#34;&gt;Vous pouvez aussi faire notre &lt;a href=&#34;demo.html&#34;&gt;demo &lt;/a&gt; avant de vous lancer.%0A                  &lt;/h3&gt;%0A            %0A                  &lt;div class=&#34;mt-5&#34;&gt;%0A                    &lt;img alt=&#34;Logo cameroun&#34; width=&#34;150&#34; src=&#34;Armoiries_de_Marseille.svg&#34; /&gt;%0A                  &lt;/div&gt;%0A                  &lt;p class=&#34;mt-3 mb-3 text-muted&#34;&gt;&amp;copy; 2020 - &lt;a href=&#34;mailto: mtchoun-mouh.517d52500895ecc79cf4b19d5745e1c3.show-sender@streams.zulipchat.com&#34;&gt;Contact&lt;/a&gt;&lt;/p&gt;%0A                &lt;/form&gt;%0A            %0A                &lt;!-- Modal HTML embedded directly into document --&gt;%0A                &lt;div id=&#34;confirmationModal&#34; class=&#34;modal&#34;&gt;%0A                  &lt;h4%0A                    style=&#34;%0A                      width: 100%25;%0A                      heigth: 100px;%0A                      margin: 0px;%0A                      background-color: rgb(57, 66, 66);%0A                      color: whitesmoke;%0A                    &#34;%0A                  &gt;%0A                    Nous devons confirmer les informations précédentes.%0A                  &lt;/h4&gt;%0A                  &lt;div style=&#34;margin-top: 50px&#34;&gt;%0A                    &lt;div class=&#34;form-group row&#34;&gt;%0A                      &lt;label style=&#34;padding-left: 30px&#34; for=&#34;input-name&#34;&gt;Name:&lt;/label&gt;%0A                      &lt;input%0A                        type=&#34;text&#34;%0A                        name=&#34;confirmationName&#34;%0A                        class=&#34;form-control&#34;%0A                        id=&#34;confirmationName&#34;%0A                        onPaste=&#34;disablePaste(event)&#34;%0A                        placeholder=&#34;Veuillez resaisir votre nom...&#34;%0A                      /&gt;%0A                      &lt;div id=&#34;feedbackName&#34; class=&#34;valid-feedback&#34;&gt;Looks good!&lt;/div&gt;%0A                    &lt;/div&gt;%0A                    &lt;div class=&#34;form-group row&#34;&gt;%0A                      &lt;label style=&#34;padding-left: 30px&#34; for=&#34;input-name&#34;&gt;Email:&lt;/label&gt;%0A                      &lt;input%0A                        type=&#34;email&#34;%0A                        name=&#34;confirmationEmail&#34;%0A                        class=&#34;form-control&#34;%0A                        id=&#34;confirmationEmail&#34;%0A                        placeholder=&#34;Veuillez resaisir votre adresse mail...&#34;%0A                      /&gt;%0A                    &lt;/div&gt;%0A                    &lt;div id=&#34;feedbackEmail&#34; class=&#34;valid-feedback&#34;&gt;Looks good!&lt;/div&gt;%0A                  &lt;/div&gt;%0A                  &lt;a href=&#34;#&#34;%0A                    &gt;&lt;button%0A                      class=&#34;col-4 btn btn-lg btn-warning&#34;%0A                      onClick=&#34;submitToAPI(event)&#34;%0A                    &gt;%0A                      Confirm%0A                    &lt;/button&gt;%0A                  &lt;/a&gt;%0A                &lt;/div&gt;%0A            %0A                &lt;!-- Alert error --&gt;%0A                &lt;div id=&#34;errorMessage&#34; class=&#34;modal&#34;&gt;%0A                  &lt;p&gt;Content error&lt;/p&gt;%0A                &lt;/div&gt;%0A              &lt;/body&gt;%0A            &lt;/html&gt;%0A        EOT%0A      &#43; content_base64sha256 = (known after apply)%0A      &#43; content_base64sha512 = (known after apply)%0A      &#43; content_md5          = (known after apply)%0A      &#43; content_sha1         = (known after apply)%0A      &#43; content_sha256       = (known after apply)%0A      &#43; content_sha512       = (known after apply)%0A      &#43; directory_permission = &#34;0777&#34;%0A      &#43; file_permission      = &#34;0777&#34;%0A      &#43; filename             = &#34;../html/index.html&#34;%0A      &#43; id                   = (known after apply)%0A    }%0A%0APlan: 4 to add, 2 to change, 0 to destroy.%0A%0AChanges to Outputs:%0A  &#43; website_url = (known after apply)%0Aaws_s3_bucket.images: Creating...%0Aaws_lambda_function.scan: Modifying... [id=check_liveness_after_site_deployment-scan_user_consulcam]%0Aaws_s3_bucket.website: Creating...%0Aaws_lambda_function.lambda: Modifying... [id=check_liveness_after_site_deployment-user_registration_consulcam]%0Alocal_file.demo_page: Creating...%0Alocal_file.demo_page: Creation complete after 0s [id=cb50a1ca1de030f95cf39d7d10977ca658b16d16]%0Alocal_file.index_page: Creating...%0Alocal_file.index_page: Creation complete after 0s [id=21584e76cf52557980c88be800828f84923a1b2d]%0Aaws_lambda_function.scan: Modifications complete after 3s [id=check_liveness_after_site_deployment-scan_user_consulcam]%0Aaws_lambda_function.lambda: Modifications complete after 7s [id=check_liveness_after_site_deployment-user_registration_consulcam]%0A
::debug::stderr: %0AError: Error validating S3 bucket name: only lowercase alphanumeric characters and hyphens allowed in &#34;check_liveness_after_site_deployment-djansang&#34;%0A%0A  with aws_s3_bucket.images,%0A  on main.tf line 1, in resource &#34;aws_s3_bucket&#34; &#34;images&#34;:%0A   1: resource &#34;aws_s3_bucket&#34; &#34;images&#34; {%0A%0A%0AError: Error validating S3 bucket name: only lowercase alphanumeric characters and hyphens allowed in &#34;check_liveness_after_site_deployment-mtchoun-mouh.mongulu.cm&#34;%0A%0A  with aws_s3_bucket.website,%0A  on main.tf line 27, in resource &#34;aws_s3_bucket&#34; &#34;website&#34;:%0A  27: resource &#34;aws_s3_bucket&#34; &#34;website&#34; {%0A%0A
::debug::exitcode: 1
::set-output name=stdout::data.archive_file.lambda_zip: Reading...%0Adata.archive_file.lambda_zip: Read complete after 0s [id=ee48131320212cb82aff0641d2438851dc364b80]%0Aaws_dynamodb_table.Register: Refreshing state... [id=check_liveness_after_site_deployment-Register]%0Adata.aws_caller_identity.current: Reading...%0Aaws_api_gateway_rest_api.api: Refreshing state... [id=w1xhimfrng]%0Adata.aws_iam_role.role: Reading...%0Adata.aws_iam_policy_document.override: Reading...%0Aaws_cloudwatch_event_rule.scheduler: Refreshing state... [id=check_liveness_after_site_deployment-trigger_user_scan]%0Aaws_dynamodb_table.Link_table: Refreshing state... [id=check_liveness_after_site_deployment-Link_table]%0Adata.aws_iam_policy_document.override: Read complete after 0s [id=335005607]%0Aaws_dynamodb_table.Users: Refreshing state... [id=check_liveness_after_site_deployment-Users]%0Adata.aws_caller_identity.current: Read complete after 0s [id=053932140667]%0Adata.aws_iam_role.role: Read complete after 0s [id=website-deployer]%0Aaws_lambda_function.scan: Refreshing state... [id=check_liveness_after_site_deployment-scan_user_consulcam]%0Aaws_lambda_function.lambda: Refreshing state... [id=check_liveness_after_site_deployment-user_registration_consulcam]%0Aaws_api_gateway_resource.resource: Refreshing state... [id=k688vp]%0Aaws_api_gateway_method.method: Refreshing state... [id=agm-w1xhimfrng-k688vp-POST]%0Amodule.cors.aws_api_gateway_method._: Refreshing state... [id=agm-w1xhimfrng-k688vp-OPTIONS]%0Aaws_lambda_permission.allow_cloudwatch_to_call_check_foo: Refreshing state... [id=AllowExecutionFromCloudWatch]%0Aaws_cloudwatch_event_target.target: Refreshing state... [id=check_liveness_after_site_deployment-trigger_user_scan-lambda]%0Amodule.cors.aws_api_gateway_method_response._: Refreshing state... [id=agmr-w1xhimfrng-k688vp-OPTIONS-200]%0Aaws_lambda_permission.apigw_lambda: Refreshing state... [id=AllowExecutionFromAPIGateway]%0Amodule.cors.aws_api_gateway_integration._: Refreshing state... [id=agi-w1xhimfrng-k688vp-OPTIONS]%0Aaws_api_gateway_method_response.method_response_200: Refreshing state... [id=agmr-w1xhimfrng-k688vp-POST-200]%0Aaws_api_gateway_integration.integration: Refreshing state... [id=agi-w1xhimfrng-k688vp-POST]%0Aaws_api_gateway_deployment.test: Refreshing state... [id=8ktaba]%0Amodule.cors.aws_api_gateway_integration_response._: Refreshing state... [id=agir-w1xhimfrng-k688vp-OPTIONS-200]%0Alocal_file.demo_page: Refreshing state... [id=cb50a1ca1de030f95cf39d7d10977ca658b16d16]%0Alocal_file.index_page: Refreshing state... [id=21584e76cf52557980c88be800828f84923a1b2d]%0A%0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  &#43; create%0A  ~ update in-place%0A%0ATerraform will perform the following actions:%0A%0A  # aws_lambda_function.lambda will be updated in-place%0A  ~ resource &#34;aws_lambda_function&#34; &#34;lambda&#34; {%0A        id                             = &#34;check_liveness_after_site_deployment-user_registration_consulcam&#34;%0A      ~ last_modified                  = &#34;2023-03-20T16:59:55.000&#43;0000&#34; -&gt; (known after apply)%0A      ~ source_code_hash               = &#34;h3/&#43;PKoQaqFl2h90TU3JrzhYnEl1fb5Xe1A5T1eW1sY=&#34; -&gt; &#34;nh759jHoU7SJBsYm14XG5cjr0zauYDnuWJJp2mVxvAY=&#34;%0A        tags                           = {%0A            &#34;environment&#34; = &#34;master&#34;%0A            &#34;project&#34;     = &#34;mtchoun-mouh&#34;%0A        }%0A        # (17 unchanged attributes hidden)%0A%0A        # (2 unchanged blocks hidden)%0A    }%0A%0A  # aws_lambda_function.scan will be updated in-place%0A  ~ resource &#34;aws_lambda_function&#34; &#34;scan&#34; {%0A        id                             = &#34;check_liveness_after_site_deployment-scan_user_consulcam&#34;%0A      ~ last_modified                  = &#34;2023-03-20T16:59:58.000&#43;0000&#34; -&gt; (known after apply)%0A      ~ source_code_hash               = &#34;h3/&#43;PKoQaqFl2h90TU3JrzhYnEl1fb5Xe1A5T1eW1sY=&#34; -&gt; &#34;nh759jHoU7SJBsYm14XG5cjr0zauYDnuWJJp2mVxvAY=&#34;%0A        tags                           = {%0A            &#34;environment&#34; = &#34;master&#34;%0A            &#34;project&#34;     = &#34;mtchoun-mouh&#34;%0A        }%0A        # (17 unchanged attributes hidden)%0A%0A        # (2 unchanged blocks hidden)%0A    }%0A%0A  # aws_s3_bucket.images will be created%0A  &#43; resource &#34;aws_s3_bucket&#34; &#34;images&#34; {%0A      &#43; acceleration_status         = (known after apply)%0A      &#43; acl                         = &#34;private&#34;%0A      &#43; arn                         = (known after apply)%0A      &#43; bucket                      = &#34;check_liveness_after_site_deployment-djansang&#34;%0A      &#43; bucket_domain_name          = (known after apply)%0A      &#43; bucket_regional_domain_name = (known after apply)%0A      &#43; force_destroy               = true%0A      &#43; hosted_zone_id              = (known after apply)%0A      &#43; id                          = (known after apply)%0A      &#43; region                      = (known after apply)%0A      &#43; request_payer               = (known after apply)%0A      &#43; tags                        = {%0A          &#43; &#34;Name&#34;        = &#34;images&#34;%0A          &#43; &#34;environment&#34; = &#34;master&#34;%0A          &#43; &#34;project&#34;     = &#34;mtchoun-mouh&#34;%0A        }%0A      &#43; tags_all                    = {%0A          &#43; &#34;Name&#34;        = &#34;images&#34;%0A          &#43; &#34;environment&#34; = &#34;master&#34;%0A          &#43; &#34;project&#34;     = &#34;mtchoun-mouh&#34;%0A        }%0A      &#43; website_domain              = (known after apply)%0A      &#43; website_endpoint            = (known after apply)%0A    }%0A%0A  # aws_s3_bucket.website will be created%0A  &#43; resource &#34;aws_s3_bucket&#34; &#34;website&#34; {%0A      &#43; acceleration_status         = (known after apply)%0A      &#43; acl                         = &#34;public-read&#34;%0A      &#43; arn                         = (known after apply)%0A      &#43; bucket                      = &#34;check_liveness_after_site_deployment-mtchoun-mouh.mongulu.cm&#34;%0A      &#43; bucket_domain_name          = (known after apply)%0A      &#43; bucket_regional_domain_name = (known after apply)%0A      &#43; force_destroy               = true%0A      &#43; hosted_zone_id              = (known after apply)%0A      &#43; id                          = (known after apply)%0A      &#43; policy                      = jsonencode(%0A            {%0A              &#43; Statement = [%0A                  &#43; {%0A                      &#43; Action    = &#34;s3:GetObject&#34;%0A                      &#43; Effect    = &#34;Allow&#34;%0A                      &#43; Principal = {%0A                          &#43; &#34;*&#34; = &#34;AWS&#34;%0A                        }%0A                      &#43; Resource  = &#34;arn:aws:s3:::check_liveness_after_site_deployment-mtchoun-mouh.mongulu.cm/*&#34;%0A                      &#43; Sid       = &#34;PublicReadForGetBucketObjects&#34;%0A                    },%0A                ]%0A              &#43; Version   = &#34;2012-10-17&#34;%0A            }%0A        )%0A      &#43; region                      = (known after apply)%0A      &#43; request_payer               = (known after apply)%0A      &#43; tags                        = {%0A          &#43; &#34;Name&#34;        = &#34;Website&#34;%0A          &#43; &#34;environment&#34; = &#34;master&#34;%0A          &#43; &#34;project&#34;     = &#34;mtchoun-mouh&#34;%0A        }%0A      &#43; tags_all                    = {%0A          &#43; &#34;Name&#34;        = &#34;Website&#34;%0A          &#43; &#34;environment&#34; = &#34;master&#34;%0A          &#43; &#34;project&#34;     = &#34;mtchoun-mouh&#34;%0A        }%0A      &#43; website_domain              = (known after apply)%0A      &#43; website_endpoint            = (known after apply)%0A%0A      &#43; cors_rule {%0A          &#43; allowed_headers = [%0A              &#43; &#34;*&#34;,%0A            ]%0A          &#43; allowed_methods = [%0A              &#43; &#34;PUT&#34;,%0A              &#43; &#34;POST&#34;,%0A              &#43; &#34;GET&#34;,%0A            ]%0A          &#43; allowed_origins = [%0A              &#43; &#34;*&#34;,%0A            ]%0A        }%0A%0A      &#43; website {%0A          &#43; error_document = &#34;error.html&#34;%0A          &#43; index_document = &#34;index.html&#34;%0A        }%0A    }%0A%0A  # local_file.demo_page will be created%0A  &#43; resource &#34;local_file&#34; &#34;demo_page&#34; {%0A      &#43; content              = &lt;&lt;-EOT%0A            &lt;!DOCTYPE html&gt;%0A            &lt;html lang=&#34;en&#34;&gt;%0A              &lt;head&gt;%0A                &lt;meta charset=&#34;UTF-8&#34; /&gt;%0A                &lt;meta name=&#34;viewport&#34; content=&#34;width=device-width,initial-scale=1.0&#34; /&gt;%0A                &lt;meta name=&#34;description&#34; content=&#34;Recevez une notification dès la sortie de votre passeport sans prise de tête :)&#34;/&gt;%0A                &lt;script src=&#34;https://code.jquery.com/jquery-3.3.1.min.js&#34;&gt;&lt;/script&gt;%0A                &lt;script%0A                  src=&#34;https://cdn.jsdelivr.net/npm/popper.js@1.16.1/dist/umd/popper.min.js&#34;%0A                  integrity=&#34;sha384-9/reFTGAW83EW2RDu2S0VKaIzap3H66lZH81PoYlFhbGU&#43;6BZp6G7niu735Sk7lN&#34;%0A                  crossorigin=&#34;anonymous&#34;%0A                &gt;&lt;/script&gt;%0A                &lt;script%0A                  src=&#34;https://cdn.jsdelivr.net/npm/bootstrap@4.5.3/dist/js/bootstrap.min.js&#34;%0A                  integrity=&#34;sha384-w1Q4orYjBQndcko6MimVbzY0tgp4pWB4lZ7lr30WKz0vr/aWKhXdBNmNb5D92v7s&#34;%0A                  crossorigin=&#34;anonymous&#34;%0A                &gt;&lt;/script&gt;%0A                &lt;link%0A                  rel=&#34;stylesheet&#34;%0A                  href=&#34;https://stackpath.bootstrapcdn.com/bootstrap/4.5.2/css/bootstrap.min.css&#34;%0A                  integrity=&#34;sha384-JcKb8q3iqJ61gNV9KGb8thSsNjpSL0n8PARn9HuZOnIxN0hoP&#43;VmmDGMN5t9UJ0Z&#34;%0A                  crossorigin=&#34;anonymous&#34;%0A                /&gt;%0A                &lt;link rel=&#34;stylesheet&#34; href=&#34;style.css&#34; /&gt;%0A                &lt;title&gt;Mtchoun&#39; mouh&lt;/title&gt;%0A                &lt;!-- jQuery Modal --&gt;%0A                &lt;script src=&#34;https://cdnjs.cloudflare.com/ajax/libs/jquery-modal/0.9.1/jquery.modal.min.js&#34;&gt;&lt;/script&gt;%0A                &lt;link%0A                  rel=&#34;stylesheet&#34;%0A                  href=&#34;https://cdnjs.cloudflare.com/ajax/libs/jquery-modal/0.9.1/jquery.modal.min.css&#34;%0A                /&gt;%0A                &lt;script type=&#34;text/javascript&#34;&gt;%0A                  $(function () {%0A                    $(&#34;#help&#34;).popover({%0A                      trigger: &#34;focus&#34;,%0A                    });%0A                  });%0A            %0A                  // disable onPaste%0A                  function disablePaste(e) {%0A                    return false;%0A                  }%0A                  // validate data%0A                  function controlFormData(e) {%0A                    e.preventDefault();%0A                    var Namere = /[A-Za-z]{1}[A-Za-z]/;%0A                    if (!Namere.test($(&#34;#name-input&#34;).val())) {%0A                      //alert(&#34;Name can not less than 2 char&#34;);%0A                      $(&#34;#errorMessage&gt;p&#34;).html(&#34;Le nom ne peut avoir moins de 2 caractères!&#34;);%0A                      $(&#34;#errorMessage&#34;).modal(&#34;show&#34;);%0A                      return;%0A                    }%0A            %0A                    $(&#34;#confirmationModal&#34;).modal(&#34;show&#34;);%0A                  }%0A            %0A                  function submitToAPI(e) {%0A                    e.preventDefault();%0A                    var URL = &#34;https://w1xhimfrng.execute-api.eu-central-1.amazonaws.com/check_liveness_after_site_deployment-dev/register&#34;;%0A            %0A                    var name = $(&#34;#name-input&#34;).val();%0A                    var data = {%0A                      name: name,%0A                    };%0A            %0A                    $.ajax({%0A                      type: &#34;POST&#34;,%0A                      url: URL,%0A                      dataType: &#34;json&#34;,%0A                      crossDomain: &#34;true&#34;,%0A                      contentType: &#34;application/json; charset=utf-8&#34;,%0A                      data: JSON.stringify(data),%0A            %0A                      success: function (response) {%0A                        // clear form and show a success message%0A                        $(&#34;#errorMessage&gt;p&#34;).html(%0A                          &#34;Nous avons  trouvé l &lt;a href=&#34;&#43;response[&#34;message&#34;]&#43;&#34;&gt;image&lt;/a&gt; d&#39;où provient votre choix &amp;#128578;&#34;%0A            %0A                        );%0A                        $(&#34;#errorMessage&#34;).css(&#34;background&#34;, &#34;#0f7555&#34;);%0A                        console.log(&#34;ok&#34;)%0A                        $(&#34;#errorMessage&#34;).modal(&#34;show&#34;);%0A                        document.getElementById(&#34;contact-form&#34;).reset();%0A                        //location.reload();%0A                      },%0A                      error: function () {%0A                        // show an error message%0A                        $(&#34;#errorMessage&gt;p&#34;).html(%0A                          &#34;Le nom rentré n&#39;existe pas. \n Veuillez vérifier l&#39;orthographe. &#34;%0A                        );%0A                        $(&#34;#errorMessage&#34;).modal(&#34;show&#34;);%0A                        //location.reload();%0A                      },%0A                    });%0A                  }%0A                &lt;/script&gt;%0A              &lt;/head&gt;%0A              &lt;body class=&#34;text-center&#34;&gt;%0A                &lt;!--https://aws.amazon.com/fr/blogs/architecture/create-dynamic-contact-forms-for-s3-static-websites-using-aws-lambda-amazon-api-gateway-and-amazon-ses/--&gt;%0A                &lt;form id=&#34;contact-form&#34; method=&#34;post&#34; class=&#34;form-signin&#34;&gt;%0A                  &lt;div class=&#34;mb-2&#34;&gt;%0A                    &lt;img alt=&#34;Logo cameroun&#34; width=&#34;150&#34; src=&#34;Armoiries_cameroun.svg&#34; /&gt;%0A                  &lt;/div&gt;%0A                  &lt;h1 class=&#34;h5 font-weight-normal highlight&#34;&gt;Si vous êtes là c&#39;est que vous voulez une démonstration. Pas de soucis &amp;#128578; &lt;/h1&gt;%0A                  &lt;h2 class=&#34;h6 font-weight-normal highlight&#34;&gt;Nous vous proposons donc de choisir un nom au hasard dans le &lt;b&gt;communiqué du 22/09/2020&lt;/b&gt;.%0A                      Pour cela rien de plus simple: rendez vous juste sur la page du &lt;a href=&#34;https://www.consulacam-marseille.fr/index.php?p=consulat-cameroun-passeports&#34;&gt;consulat&lt;/a&gt;%0A                      et entrez ci-dessous celui-ci choisi.%0A                  &lt;/h2&gt;%0A                  &lt;b&gt;NOTEZ BIEN &lt;/b&gt;%0A                  &lt;svg%0A                    data-html=&#34;true&#34;%0A                    tabindex=&#34;0&#34;%0A                    id=&#34;help&#34;%0A                    data-toggle=&#34;popover&#34;%0A                    data-trigger=&#34;focus&#34;%0A                    title=&#34;Important !&#34;%0A                    data-content=&#34;&lt;p&gt;Le nom doit être écrit pareil et dans le même ordre que celui choisi dans la page du consulat&lt;/p&gt;%0A                                  &lt;p&gt;Liste des contraintes actuelles (vérifiez que vous n&#39;entrez pas dans ces cas) qui ne sont pas supportés: &lt;/p&gt;%0A                                  &lt;ol&gt;%0A                                    &lt;li&gt;Les noms comprenant le mot &lt;b&gt;vve&lt;/b&gt;&lt;/li&gt;%0A                                    &lt;li&gt;Les noms comprenant les accents circonflexes comme Benoît&lt;/li&gt;%0A                                    &lt;li&gt;Les noms comprenant les trémas comme Raïssa&lt;/li&gt;%0A                                    &lt;li&gt;Les noms comprenant qu&#39;un seul mot &lt;/li&gt;%0A                                    &lt;li&gt;Les noms comprenant un mot se terminant par i comme Etoundi &lt;/li&gt;%0A                                    &lt;li&gt;Les noms comprenant des chiffres romains&lt;/li&gt;%0A                                  &lt;/ol&gt;&#34;%0A                    aria-hidden=&#34;true&#34;%0A                    focusable=&#34;false&#34;%0A                    data-prefix=&#34;fas&#34;%0A                    data-icon=&#34;info-circle&#34;%0A                    class=&#34;svg-inline--fa fa-info-circle fa-w-16&#34;%0A                    role=&#34;img&#34;%0A                    xmlns=&#34;http://www.w3.org/2000/svg&#34;%0A                    viewBox=&#34;0 0 512 512&#34;%0A                  &gt;%0A                    &lt;path%0A                      fill=&#34;currentColor&#34;%0A                      d=&#34;M256 8C119.043 8 8 119.083 8 256c0 136.997 111.043 248 248 248s248-111.003 248-248C504 119.083 392.957 8 256 8zm0 110c23.196 0 42 18.804 42 42s-18.804 42-42 42-42-18.804-42-42 18.804-42 42-42zm56 254c0 6.627-5.373 12-12 12h-88c-6.627 0-12-5.373-12-12v-24c0-6.627 5.373-12 12-12h12v-64h-12c-6.627 0-12-5.373-12-12v-24c0-6.627 5.373-12 12-12h64c6.627 0 12 5.373 12 12v100h12c6.627 0 12 5.373 12 12v24z&#34;%0A                    &gt;&lt;/path&gt;%0A                  &lt;/svg&gt;%0A                  &lt;label for=&#34;input-name&#34; class=&#34;sr-only&#34;&gt;Name:&lt;/label&gt;%0A                  &lt;input%0A                    type=&#34;text&#34;%0A                    id=&#34;name-input&#34;%0A                    placeholder=&#34;Veuillez le nom choisi …&#34;%0A                    style=&#34;text-transform: uppercase&#34;%0A                    class=&#34;form-control&#34;%0A                  /&gt;%0A                  &lt;div%0A                    class=&#34;g-recaptcha&#34;%0A                    data-sitekey=&#34;6Lc7cVMUAAAAAM1yxf64wrmO8gvi8A1oQ_ead1ys&#34;%0A                  &gt;&lt;/div&gt;%0A            %0A                  &lt;button%0A                    class=&#34;btn btn-lg btn-primary btn-block&#34;%0A                    type=&#34;button&#34;%0A                    onClick=&#34;submitToAPI(event)&#34;%0A                  &gt;%0A                    Submit%0A                  &lt;/button&gt;%0A            %0A                  &lt;h3 class=&#34;h6 mt-2 font-weight-normal&#34;&gt;Retournez en &lt;a href=&#34;index.html&#34;&gt;page d&#39;accueil &lt;/a&gt; &lt;/h3&gt;%0A            %0A                  &lt;div class=&#34;mt-5&#34;&gt;%0A                    &lt;img alt=&#34;Logo cameroun&#34; width=&#34;150&#34; src=&#34;Armoiries_de_Marseille.svg&#34; /&gt;%0A                  &lt;/div&gt;%0A                  &lt;p class=&#34;mt-3 mb-3 text-muted&#34;&gt;&amp;copy; 2020 - &lt;a href=&#34;mailto: mtchoun-mouh.517d52500895ecc79cf4b19d5745e1c3.show-sender@streams.zulipchat.com&#34;&gt;Contact&lt;/a&gt;&lt;/p&gt;%0A                &lt;/form&gt;%0A            %0A                &lt;!-- Alert-error --&gt;%0A                &lt;div id=&#34;errorMessage&#34; class=&#34;modal&#34;&gt;%0A                  &lt;p&gt;Content error&lt;/p&gt;%0A                &lt;/div&gt;%0A              &lt;/body&gt;%0A            &lt;/html&gt;%0A        EOT%0A      &#43; content_base64sha256 = (known after apply)%0A      &#43; content_base64sha512 = (known after apply)%0A      &#43; content_md5          = (known after apply)%0A      &#43; content_sha1         = (known after apply)%0A      &#43; content_sha256       = (known after apply)%0A      &#43; content_sha512       = (known after apply)%0A      &#43; directory_permission = &#34;0777&#34;%0A      &#43; file_permission      = &#34;0777&#34;%0A      &#43; filename             = &#34;../html/demo.html&#34;%0A      &#43; id                   = (known after apply)%0A    }%0A%0A  # local_file.index_page will be created%0A  &#43; resource &#34;local_file&#34; &#34;index_page&#34; {%0A      &#43; content              = &lt;&lt;-EOT%0A            &lt;!DOCTYPE html&gt;%0A            &lt;html lang=&#34;en&#34;&gt;%0A              &lt;head&gt;%0A                &lt;meta charset=&#34;UTF-8&#34; /&gt;%0A                &lt;meta name=&#34;viewport&#34; content=&#34;width=device-width,initial-scale=1.0&#34; /&gt;%0A                &lt;meta name=&#34;description&#34; content=&#34;Recevez une notification dès la sortie de votre passeport sans prise de tête :)&#34;/&gt;%0A                &lt;script src=&#34;https://code.jquery.com/jquery-3.3.1.min.js&#34;&gt;&lt;/script&gt;%0A                &lt;script%0A                  src=&#34;https://cdn.jsdelivr.net/npm/popper.js@1.16.1/dist/umd/popper.min.js&#34;%0A                  integrity=&#34;sha384-9/reFTGAW83EW2RDu2S0VKaIzap3H66lZH81PoYlFhbGU&#43;6BZp6G7niu735Sk7lN&#34;%0A                  crossorigin=&#34;anonymous&#34;%0A                &gt;&lt;/script&gt;%0A                &lt;script%0A                  src=&#34;https://cdn.jsdelivr.net/npm/bootstrap@4.5.3/dist/js/bootstrap.min.js&#34;%0A                  integrity=&#34;sha384-w1Q4orYjBQndcko6MimVbzY0tgp4pWB4lZ7lr30WKz0vr/aWKhXdBNmNb5D92v7s&#34;%0A                  crossorigin=&#34;anonymous&#34;%0A                &gt;&lt;/script&gt;%0A                &lt;link%0A                  rel=&#34;stylesheet&#34;%0A                  href=&#34;https://stackpath.bootstrapcdn.com/bootstrap/4.5.2/css/bootstrap.min.css&#34;%0A                  integrity=&#34;sha384-JcKb8q3iqJ61gNV9KGb8thSsNjpSL0n8PARn9HuZOnIxN0hoP&#43;VmmDGMN5t9UJ0Z&#34;%0A                  crossorigin=&#34;anonymous&#34;%0A                /&gt;%0A                &lt;link rel=&#34;stylesheet&#34; href=&#34;style.css&#34; /&gt;%0A                &lt;!-- Matomo Tag Manager --&gt;%0A                &lt;script&gt;%0A                var _mtm = window._mtm = window._mtm || [];%0A                _mtm.push({&#39;mtm.startTime&#39;: (new Date().getTime()), &#39;event&#39;: &#39;mtm.Start&#39;});%0A                var d=document, g=d.createElement(&#39;script&#39;), s=d.getElementsByTagName(&#39;script&#39;)[0];%0A                g.async=true; g.src=&#39;https://matomo.mongulu.cm/js/container_mkXxNHkb.js&#39;; s.parentNode.insertBefore(g,s);%0A                &lt;/script&gt;%0A                &lt;!-- End Matomo Tag Manager --&gt;%0A                &lt;title&gt;Mtchoun&#39; mouh&lt;/title&gt;%0A                &lt;!-- jQuery Modal --&gt;%0A                &lt;script src=&#34;https://cdnjs.cloudflare.com/ajax/libs/jquery-modal/0.9.1/jquery.modal.min.js&#34;&gt;&lt;/script&gt;%0A                &lt;link%0A                  rel=&#34;stylesheet&#34;%0A                  href=&#34;https://cdnjs.cloudflare.com/ajax/libs/jquery-modal/0.9.1/jquery.modal.min.css&#34;%0A                /&gt;%0A                &lt;script type=&#34;text/javascript&#34;&gt;%0A                  $(function () {%0A                    $(&#34;#help&#34;).popover({%0A                      trigger: &#34;focus&#34;,%0A                    });%0A                  });%0A                  $(function () {%0A                    $(&#34;#help2&#34;).popover({%0A                      trigger: &#34;focus&#34;,%0A                    });%0A                  });%0A                  // disable onPaste%0A                  function disablePaste(e) {%0A                    return false;%0A                  }%0A                  // validate data%0A                  function controlFormData(e) {%0A                    e.preventDefault();%0A                    var Namere = /[A-Za-z]{1}[A-Za-z]/;%0A                    if (!Namere.test($(&#34;#name-input&#34;).val())) {%0A                      //alert(&#34;Name can not less than 2 char&#34;);%0A                      $(&#34;#errorMessage&gt;p&#34;).html(&#34;Le nom ne peut avoir moins de 2 caractères!&#34;);%0A                      $(&#34;#errorMessage&#34;).modal(&#34;show&#34;);%0A                      return;%0A                    }%0A                    if ($(&#34;#email-input&#34;).val() == &#34;&#34;) {%0A                      $(&#34;#errorMessage&gt;p&#34;).html(&#34;Veuillez entrer une adresse email valide!&#34;);%0A                      $(&#34;#errorMessage&#34;).modal(&#34;show&#34;);%0A                      return;%0A                    }%0A                    var reeamil = /^([\w-\.]&#43;@([\w-]&#43;\.)&#43;[\w-]{2,6})?$/;%0A                    if (!reeamil.test($(&#34;#email-input&#34;).val())) {%0A                      $(&#34;#errorMessage&gt;p&#34;).html(&#34;Veuillez entrer une adresse email valide!&#34;);%0A                      $(&#34;#errorMessage&#34;).modal(&#34;show&#34;);%0A                      return;%0A                    }%0A            %0A                    $(&#34;#confirmationName&#34;).val($(&#34;#name-input&#34;).val());%0A                    $(&#34;#confirmationEmail&#34;).val($(&#34;#email-input&#34;).val());%0A                    $(&#34;#confirmationModal&#34;).modal(&#34;show&#34;);%0A                  }%0A            %0A                  function submitToAPI(e) {%0A                    e.preventDefault();%0A                    var URL = &#34;https://w1xhimfrng.execute-api.eu-central-1.amazonaws.com/check_liveness_after_site_deployment-dev/register&#34;;%0A            %0A                    if ($(&#34;#name-input&#34;).val() != $(&#34;#confirmationName&#34;).val()) {%0A                      $(&#34;#feedbackName&#34;).html(&#34;Votre nom ne correspond pas!&#34;);%0A                      $(&#34;#feedbackName&#34;).css(&#34;display&#34;, &#34;block&#34;);%0A                      return;%0A                    }%0A                    if ($(&#34;#email-input&#34;).val() != $(&#34;#confirmationEmail&#34;).val()) {%0A                      $(&#34;#feedbackEmail&#34;).html(&#34;Votre adresse mail ne correspond pas!&#34;);%0A                      $(&#34;#feedbackEmail&#34;).css(&#34;display&#34;, &#34;block&#34;);%0A                      return;%0A                    }%0A            %0A                    var name = $(&#34;#name-input&#34;).val();%0A                    var email = $(&#34;#email-input&#34;).val();%0A                    var data = {%0A                      name: name,%0A                      email: email,%0A                    };%0A            %0A                    $.ajax({%0A                      type: &#34;POST&#34;,%0A                      url: URL,%0A                      dataType: &#34;json&#34;,%0A                      crossDomain: &#34;true&#34;,%0A                      contentType: &#34;application/json; charset=utf-8&#34;,%0A                      data: JSON.stringify(data),%0A            %0A                      success: function () {%0A                        // clear form and show a success message%0A                        $(&#34;#errorMessage&gt;p&#34;).html(%0A                          &#34;Consultez votre email. Un lien de confirmation vous a été envoyé.&#34;%0A                        );%0A                        $(&#34;#errorMessage&#34;).css(&#34;background&#34;, &#34;#0f7555&#34;);%0A                        $(&#34;#errorMessage&#34;).modal(&#34;show&#34;);%0A                        document.getElementById(&#34;contact-form&#34;).reset();%0A                        //location.reload();%0A                      },%0A                      error: function () {%0A                        // show an error message%0A                        $(&#34;#errorMessage&gt;p&#34;).html(%0A                          &#34;Nous n&#39;avons malhreusement pas pu vous enregistrer. Veuillez contacter l&#39;&lt;a href=\&#34;mailto: mtchoun-mouh.517d52500895ecc79cf4b19d5745e1c3.show-sender@streams.zulipchat.com\&#34;&gt;administrateur &lt;/a&gt;. &#34;%0A                        );%0A                        $(&#34;#errorMessage&#34;).modal(&#34;show&#34;);%0A                        location.reload();%0A                      },%0A                    });%0A                  }%0A                &lt;/script&gt;%0A              &lt;/head&gt;%0A            %0A              &lt;body class=&#34;text-center&#34;&gt;%0A                &lt;!--https://aws.amazon.com/fr/blogs/architecture/create-dynamic-contact-forms-for-s3-static-websites-using-aws-lambda-amazon-api-gateway-and-amazon-ses/--&gt;%0A                &lt;form id=&#34;contact-form&#34; method=&#34;post&#34; class=&#34;form-signin&#34;&gt;%0A                  &lt;div class=&#34;mb-2&#34;&gt;%0A                    &lt;img alt=&#34;Logo cameroun&#34; width=&#34;150&#34; src=&#34;Armoiries_cameroun.svg&#34; /&gt;%0A                  &lt;/div&gt;%0A                  &lt;h1 class=&#34;h5 font-weight-normal highlight&#34;&gt;Vous venez de déposer votre passeport au consulat de Marseille ?&lt;/h1&gt;%0A                  &lt;h2 class=&#34;h5 font-weight-normal highlight&#34;&gt;On vous a dit regarder le site régulièrement et vous avez déjà trop de choses en tête &amp;#128533;?&lt;/h2&gt;%0A                  &lt;h2 class=&#34;h6 font-weight-normal&#34;&gt;Nous pouvons vous aider en vous notifiant dès sa sortie &amp;#128526;.&lt;/h2&gt;%0A                  &lt;h3 class=&#34;h6 font-weight-normal&#34;&gt;Pour cela rien de plus simple: Rentrez ici les informations requises*&lt;/h3&gt;%0A                  &lt;b&gt;NOTEZ BIEN &lt;/b&gt;%0A                  &lt;svg%0A                    data-html=&#34;true&#34;%0A                    tabindex=&#34;0&#34;%0A                    id=&#34;help&#34;%0A                    data-toggle=&#34;popover&#34;%0A                    data-trigger=&#34;focus&#34;%0A                    title=&#34;Important !&#34;%0A                    data-content=&#34;&lt;p&gt;Le nom doit être écrit pareil et dans le même ordre que commnuniqué au consulat&lt;/p&gt;%0A                                  &lt;p&gt;Liste des contraintes actuelles (vérifiez que vous n&#39;entrez pas dans ces cas) qui ne sont pas supportés: &lt;/p&gt;%0A                                  &lt;ol&gt;%0A                                    &lt;li&gt;Les noms comprenant le mot &lt;b&gt;vve&lt;/b&gt;&lt;/li&gt;%0A                                    &lt;li&gt;Les noms comprenant les accents circonflexes comme Benoît&lt;/li&gt;%0A                                    &lt;li&gt;Les noms comprenant les trémas comme Raïssa&lt;/li&gt;%0A                                    &lt;li&gt;Les noms comprenant qu&#39;un seul mot &lt;/li&gt;%0A                                    &lt;li&gt;Les noms comprenant un mot se terminant par i comme Etoundi &lt;/li&gt;%0A                                    &lt;li&gt;Les noms comprenant des chiffres romains&lt;/li&gt;%0A                                  &lt;/ol&gt;&#34;%0A                    aria-hidden=&#34;true&#34;%0A                    focusable=&#34;false&#34;%0A                    data-prefix=&#34;fas&#34;%0A                    data-icon=&#34;info-circle&#34;%0A                    class=&#34;svg-inline--fa fa-info-circle fa-w-16&#34;%0A                    role=&#34;img&#34;%0A                    xmlns=&#34;http://www.w3.org/2000/svg&#34;%0A                    viewBox=&#34;0 0 512 512&#34;%0A                  &gt;%0A                    &lt;path%0A                      fill=&#34;currentColor&#34;%0A                      d=&#34;M256 8C119.043 8 8 119.083 8 256c0 136.997 111.043 248 248 248s248-111.003 248-248C504 119.083 392.957 8 256 8zm0 110c23.196 0 42 18.804 42 42s-18.804 42-42 42-42-18.804-42-42 18.804-42 42-42zm56 254c0 6.627-5.373 12-12 12h-88c-6.627 0-12-5.373-12-12v-24c0-6.627 5.373-12 12-12h12v-64h-12c-6.627 0-12-5.373-12-12v-24c0-6.627 5.373-12 12-12h64c6.627 0 12 5.373 12 12v100h12c6.627 0 12 5.373 12 12v24z&#34;%0A                    &gt;&lt;/path&gt;%0A                  &lt;/svg&gt;%0A                  &lt;label for=&#34;input-name&#34; class=&#34;sr-only&#34;&gt;Name:&lt;/label&gt;%0A                  &lt;input%0A                    type=&#34;text&#34;%0A                    id=&#34;name-input&#34;%0A                    placeholder=&#34;Veuillez entrer votre nom …&#34;%0A                    style=&#34;text-transform: uppercase&#34;%0A                    class=&#34;form-control&#34;%0A                  /&gt;%0A                  &lt;br /&gt;%0A                  &lt;label for=&#34;inputEmail&#34; class=&#34;sr-only&#34;&gt;Email:&lt;/label&gt;%0A                  &lt;input%0A                    type=&#34;email&#34;%0A                    id=&#34;email-input&#34;%0A                    placeholder=&#34;Veuillez entrer votre adresse mail …&#34;%0A                    class=&#34;form-control&#34;%0A                  /&gt;&lt;br /&gt;%0A                  &lt;div%0A                    class=&#34;g-recaptcha&#34;%0A                    data-sitekey=&#34;6Lc7cVMUAAAAAM1yxf64wrmO8gvi8A1oQ_ead1ys&#34;%0A                  &gt;&lt;/div&gt;%0A            %0A                  &lt;!-- Link to open the modal --&gt;%0A                  &lt;a href=&#34;#confirmationButton&#34; onClick=&#34;controlFormData(event)&#34;&gt;%0A                    &lt;button class=&#34;btn btn-lg btn-primary btn-block&#34;&gt;Soumettre&lt;/button&gt;%0A                  &lt;/a&gt;%0A                  &lt;b&gt;* PROTECTION DES DONNEES &lt;/b&gt;%0A                  &lt;svg%0A                    data-html=&#34;true&#34;%0A                    tabindex=&#34;1&#34;%0A                    id=&#34;help2&#34;%0A                    data-toggle=&#34;popover&#34;%0A                    data-trigger=&#34;focus&#34;%0A                    title=&#34;Important !&#34;%0A                    data-content=&#39;&lt;p&gt; Nous nous engageons à protéger les informations personelles transmises: &lt;/p&gt;%0A                                  &lt;ol&gt;%0A                                    &lt;li&gt;Celles-ci ne seront communiqués à aucun tiers et servent uniquement à vous envoyer votre notification&lt;/li&gt;%0A                                    &lt;li&gt;Une fois la notification envoyé, vos informations sont immédiatement supprimés, nous ne les conservons pas&lt;/li&gt;%0A                                  &lt;/ol&gt;%0A                                  &lt;p&gt; Comme preuve de bonne foi, le &lt;b&gt;code source est disponible en libre accès &lt;a href=&#34;https://github.com/mongulu-cm/mtchoun-mouh&#34;&gt; ici &lt;/a&gt; &lt;/b&gt;&#39;%0A                    aria-hidden=&#34;true&#34;%0A                    focusable=&#34;false&#34;%0A                    data-prefix=&#34;fas&#34;%0A                    data-icon=&#34;info-circle&#34;%0A                    class=&#34;svg-inline--fa fa-info-circle fa-w-16&#34;%0A                    role=&#34;img&#34;%0A                    xmlns=&#34;http://www.w3.org/2000/svg&#34;%0A                    viewBox=&#34;0 0 512 512&#34;%0A                  &gt;%0A                      &lt;path%0A                        fill=&#34;currentColor&#34;%0A                        d=&#34;M256 8C119.043 8 8 119.083 8 256c0 136.997 111.043 248 248 248s248-111.003 248-248C504 119.083 392.957 8 256 8zm0 110c23.196 0 42 18.804 42 42s-18.804 42-42 42-42-18.804-42-42 18.804-42 42-42zm56 254c0 6.627-5.373 12-12 12h-88c-6.627 0-12-5.373-12-12v-24c0-6.627 5.373-12 12-12h12v-64h-12c-6.627 0-12-5.373-12-12v-24c0-6.627 5.373-12 12-12h64c6.627 0 12 5.373 12 12v100h12c6.627 0 12 5.373 12 12v24z&#34;%0A                      &gt;&lt;/path&gt;%0A                  &lt;/svg&gt;%0A            %0A                  &lt;h3 class=&#34;h6 font-weight-normal&#34;&gt;Vous pouvez aussi faire notre &lt;a href=&#34;demo.html&#34;&gt;demo &lt;/a&gt; avant de vous lancer.%0A                  &lt;/h3&gt;%0A            %0A                  &lt;div class=&#34;mt-5&#34;&gt;%0A                    &lt;img alt=&#34;Logo cameroun&#34; width=&#34;150&#34; src=&#34;Armoiries_de_Marseille.svg&#34; /&gt;%0A                  &lt;/div&gt;%0A                  &lt;p class=&#34;mt-3 mb-3 text-muted&#34;&gt;&amp;copy; 2020 - &lt;a href=&#34;mailto: mtchoun-mouh.517d52500895ecc79cf4b19d5745e1c3.show-sender@streams.zulipchat.com&#34;&gt;Contact&lt;/a&gt;&lt;/p&gt;%0A                &lt;/form&gt;%0A            %0A                &lt;!-- Modal HTML embedded directly into document --&gt;%0A                &lt;div id=&#34;confirmationModal&#34; class=&#34;modal&#34;&gt;%0A                  &lt;h4%0A                    style=&#34;%0A                      width: 100%25;%0A                      heigth: 100px;%0A                      margin: 0px;%0A                      background-color: rgb(57, 66, 66);%0A                      color: whitesmoke;%0A                    &#34;%0A                  &gt;%0A                    Nous devons confirmer les informations précédentes.%0A                  &lt;/h4&gt;%0A                  &lt;div style=&#34;margin-top: 50px&#34;&gt;%0A                    &lt;div class=&#34;form-group row&#34;&gt;%0A                      &lt;label style=&#34;padding-left: 30px&#34; for=&#34;input-name&#34;&gt;Name:&lt;/label&gt;%0A                      &lt;input%0A                        type=&#34;text&#34;%0A                        name=&#34;confirmationName&#34;%0A                        class=&#34;form-control&#34;%0A                        id=&#34;confirmationName&#34;%0A                        onPaste=&#34;disablePaste(event)&#34;%0A                        placeholder=&#34;Veuillez resaisir votre nom...&#34;%0A                      /&gt;%0A                      &lt;div id=&#34;feedbackName&#34; class=&#34;valid-feedback&#34;&gt;Looks good!&lt;/div&gt;%0A                    &lt;/div&gt;%0A                    &lt;div class=&#34;form-group row&#34;&gt;%0A                      &lt;label style=&#34;padding-left: 30px&#34; for=&#34;input-name&#34;&gt;Email:&lt;/label&gt;%0A                      &lt;input%0A                        type=&#34;email&#34;%0A                        name=&#34;confirmationEmail&#34;%0A                        class=&#34;form-control&#34;%0A                        id=&#34;confirmationEmail&#34;%0A                        placeholder=&#34;Veuillez resaisir votre adresse mail...&#34;%0A                      /&gt;%0A                    &lt;/div&gt;%0A                    &lt;div id=&#34;feedbackEmail&#34; class=&#34;valid-feedback&#34;&gt;Looks good!&lt;/div&gt;%0A                  &lt;/div&gt;%0A                  &lt;a href=&#34;#&#34;%0A                    &gt;&lt;button%0A                      class=&#34;col-4 btn btn-lg btn-warning&#34;%0A                      onClick=&#34;submitToAPI(event)&#34;%0A                    &gt;%0A                      Confirm%0A                    &lt;/button&gt;%0A                  &lt;/a&gt;%0A                &lt;/div&gt;%0A            %0A                &lt;!-- Alert error --&gt;%0A                &lt;div id=&#34;errorMessage&#34; class=&#34;modal&#34;&gt;%0A                  &lt;p&gt;Content error&lt;/p&gt;%0A                &lt;/div&gt;%0A              &lt;/body&gt;%0A            &lt;/html&gt;%0A        EOT%0A      &#43; content_base64sha256 = (known after apply)%0A      &#43; content_base64sha512 = (known after apply)%0A      &#43; content_md5          = (known after apply)%0A      &#43; content_sha1         = (known after apply)%0A      &#43; content_sha256       = (known after apply)%0A      &#43; content_sha512       = (known after apply)%0A      &#43; directory_permission = &#34;0777&#34;%0A      &#43; file_permission      = &#34;0777&#34;%0A      &#43; filename             = &#34;../html/index.html&#34;%0A      &#43; id                   = (known after apply)%0A    }%0A%0APlan: 4 to add, 2 to change, 0 to destroy.%0A%0AChanges to Outputs:%0A  &#43; website_url = (known after apply)%0Aaws_s3_bucket.images: Creating...%0Aaws_lambda_function.scan: Modifying... [id=check_liveness_after_site_deployment-scan_user_consulcam]%0Aaws_s3_bucket.website: Creating...%0Aaws_lambda_function.lambda: Modifying... [id=check_liveness_after_site_deployment-user_registration_consulcam]%0Alocal_file.demo_page: Creating...%0Alocal_file.demo_page: Creation complete after 0s [id=cb50a1ca1de030f95cf39d7d10977ca658b16d16]%0Alocal_file.index_page: Creating...%0Alocal_file.index_page: Creation complete after 0s [id=21584e76cf52557980c88be800828f84923a1b2d]%0Aaws_lambda_function.scan: Modifications complete after 3s [id=check_liveness_after_site_deployment-scan_user_consulcam]%0Aaws_lambda_function.lambda: Modifications complete after 7s [id=check_liveness_after_site_deployment-user_registration_consulcam]%0A
::set-output name=stderr::%0AError: Error validating S3 bucket name: only lowercase alphanumeric characters and hyphens allowed in &#34;check_liveness_after_site_deployment-djansang&#34;%0A%0A  with aws_s3_bucket.images,%0A  on main.tf line 1, in resource &#34;aws_s3_bucket&#34; &#34;images&#34;:%0A   1: resource &#34;aws_s3_bucket&#34; &#34;images&#34; {%0A%0A%0AError: Error validating S3 bucket name: only lowercase alphanumeric characters and hyphens allowed in &#34;check_liveness_after_site_deployment-mtchoun-mouh.mongulu.cm&#34;%0A%0A  with aws_s3_bucket.website,%0A  on main.tf line 27, in resource &#34;aws_s3_bucket&#34; &#34;website&#34;:%0A  27: resource &#34;aws_s3_bucket&#34; &#34;website&#34; {%0A%0A
::set-output name=exitcode::1
::error::Terraform exited with code 1.</code></pre>

<details><summary>Details (Click me)</summary>

```hcl
[command]/home/runner/work/_temp/2b21e34c-23b3-49a2-a7ab-a5ae3e7c7427/terraform-bin apply -auto-approve -no-color
data.archive_file.lambda_zip: Reading...
data.archive_file.lambda_zip: Read complete after 0s [id=ee48131320212cb82aff0641d2438851dc364b80]
aws_dynamodb_table.Register: Refreshing state... [id=check_liveness_after_site_deployment-Register]
data.aws_caller_identity.current: Reading...
aws_api_gateway_rest_api.api: Refreshing state... [id=w1xhimfrng]
data.aws_iam_role.role: Reading...
data.aws_iam_policy_document.override: Reading...
aws_cloudwatch_event_rule.scheduler: Refreshing state... [id=check_liveness_after_site_deployment-trigger_user_scan]
aws_dynamodb_table.Link_table: Refreshing state... [id=check_liveness_after_site_deployment-Link_table]
data.aws_iam_policy_document.override: Read complete after 0s [id=335005607]
aws_dynamodb_table.Users: Refreshing state... [id=check_liveness_after_site_deployment-Users]
data.aws_caller_identity.current: Read complete after 0s [id=053932140667]
data.aws_iam_role.role: Read complete after 0s [id=website-deployer]
aws_lambda_function.scan: Refreshing state... [id=check_liveness_after_site_deployment-scan_user_consulcam]
aws_lambda_function.lambda: Refreshing state... [id=check_liveness_after_site_deployment-user_registration_consulcam]
aws_api_gateway_resource.resource: Refreshing state... [id=k688vp]
aws_api_gateway_method.method: Refreshing state... [id=agm-w1xhimfrng-k688vp-POST]
module.cors.aws_api_gateway_method._: Refreshing state... [id=agm-w1xhimfrng-k688vp-OPTIONS]
aws_lambda_permission.allow_cloudwatch_to_call_check_foo: Refreshing state... [id=AllowExecutionFromCloudWatch]
aws_cloudwatch_event_target.target: Refreshing state... [id=check_liveness_after_site_deployment-trigger_user_scan-lambda]
module.cors.aws_api_gateway_method_response._: Refreshing state... [id=agmr-w1xhimfrng-k688vp-OPTIONS-200]
aws_lambda_permission.apigw_lambda: Refreshing state... [id=AllowExecutionFromAPIGateway]
module.cors.aws_api_gateway_integration._: Refreshing state... [id=agi-w1xhimfrng-k688vp-OPTIONS]
aws_api_gateway_method_response.method_response_200: Refreshing state... [id=agmr-w1xhimfrng-k688vp-POST-200]
aws_api_gateway_integration.integration: Refreshing state... [id=agi-w1xhimfrng-k688vp-POST]
aws_api_gateway_deployment.test: Refreshing state... [id=8ktaba]
module.cors.aws_api_gateway_integration_response._: Refreshing state... [id=agir-w1xhimfrng-k688vp-OPTIONS-200]
local_file.demo_page: Refreshing state... [id=cb50a1ca1de030f95cf39d7d10977ca658b16d16]
local_file.index_page: Refreshing state... [id=21584e76cf52557980c88be800828f84923a1b2d]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_lambda_function.lambda will be updated in-place
  ~ resource "aws_lambda_function" "lambda" {
        id                             = "check_liveness_after_site_deployment-user_registration_consulcam"
      ~ last_modified                  = "2023-03-20T16:59:55.000+0000" -> (known after apply)
      ~ source_code_hash               = "h3/+PKoQaqFl2h90TU3JrzhYnEl1fb5Xe1A5T1eW1sY=" -> "nh759jHoU7SJBsYm14XG5cjr0zauYDnuWJJp2mVxvAY="
        tags                           = {
            "environment" = "master"
            "project"     = "mtchoun-mouh"
        }
        # (17 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # aws_lambda_function.scan will be updated in-place
  ~ resource "aws_lambda_function" "scan" {
        id                             = "check_liveness_after_site_deployment-scan_user_consulcam"
      ~ last_modified                  = "2023-03-20T16:59:58.000+0000" -> (known after apply)
      ~ source_code_hash               = "h3/+PKoQaqFl2h90TU3JrzhYnEl1fb5Xe1A5T1eW1sY=" -> "nh759jHoU7SJBsYm14XG5cjr0zauYDnuWJJp2mVxvAY="
        tags                           = {
            "environment" = "master"
            "project"     = "mtchoun-mouh"
        }
        # (17 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # aws_s3_bucket.images will be created
  + resource "aws_s3_bucket" "images" {
      + acceleration_status         = (known after apply)
      + acl                         = "private"
      + arn                         = (known after apply)
      + bucket                      = "check_liveness_after_site_deployment-djansang"
      + bucket_domain_name          = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = true
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "Name"        = "images"
          + "environment" = "master"
          + "project"     = "mtchoun-mouh"
        }
      + tags_all                    = {
          + "Name"        = "images"
          + "environment" = "master"
          + "project"     = "mtchoun-mouh"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
    }

  # aws_s3_bucket.website will be created
  + resource "aws_s3_bucket" "website" {
      + acceleration_status         = (known after apply)
      + acl                         = "public-read"
      + arn                         = (known after apply)
      + bucket                      = "check_liveness_after_site_deployment-mtchoun-mouh.mongulu.cm"
      + bucket_domain_name          = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = true
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + policy                      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "s3:GetObject"
                      + Effect    = "Allow"
                      + Principal = {
                          + "*" = "AWS"
                        }
                      + Resource  = "arn:aws:s3:::check_liveness_after_site_deployment-mtchoun-mouh.mongulu.cm/*"
                      + Sid       = "PublicReadForGetBucketObjects"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "Name"        = "Website"
          + "environment" = "master"
          + "project"     = "mtchoun-mouh"
        }
      + tags_all                    = {
          + "Name"        = "Website"
          + "environment" = "master"
          + "project"     = "mtchoun-mouh"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule {
          + allowed_headers = [
              + "*",
            ]
          + allowed_methods = [
              + "PUT",
              + "POST",
              + "GET",
            ]
          + allowed_origins = [
              + "*",
            ]
        }

      + website {
          + error_document = "error.html"
          + index_document = "index.html"
        }
    }

  # local_file.demo_page will be created
  + resource "local_file" "demo_page" {
      + content              = <<-EOT
            <!DOCTYPE html>
            <html lang="en">
              <head>
                <meta charset="UTF-8" />
                <meta name="viewport" content="width=device-width,initial-scale=1.0" />
                <meta name="description" content="Recevez une notification dès la sortie de votre passeport sans prise de tête :)"/>
                <script src="https://code.jquery.com/jquery-3.3.1.min.js"></script>
                <script
                  src="https://cdn.jsdelivr.net/npm/popper.js@1.16.1/dist/umd/popper.min.js"
                  integrity="sha384-9/reFTGAW83EW2RDu2S0VKaIzap3H66lZH81PoYlFhbGU+6BZp6G7niu735Sk7lN"
                  crossorigin="anonymous"
                ></script>
                <script
                  src="https://cdn.jsdelivr.net/npm/bootstrap@4.5.3/dist/js/bootstrap.min.js"
                  integrity="sha384-w1Q4orYjBQndcko6MimVbzY0tgp4pWB4lZ7lr30WKz0vr/aWKhXdBNmNb5D92v7s"
                  crossorigin="anonymous"
                ></script>
                <link
                  rel="stylesheet"
                  href="https://stackpath.bootstrapcdn.com/bootstrap/4.5.2/css/bootstrap.min.css"
                  integrity="sha384-JcKb8q3iqJ61gNV9KGb8thSsNjpSL0n8PARn9HuZOnIxN0hoP+VmmDGMN5t9UJ0Z"
                  crossorigin="anonymous"
                />
                <link rel="stylesheet" href="style.css" />
                <title>Mtchoun' mouh</title>
                <!-- jQuery Modal -->
                <script src="https://cdnjs.cloudflare.com/ajax/libs/jquery-modal/0.9.1/jquery.modal.min.js"></script>
                <link
                  rel="stylesheet"
                  href="https://cdnjs.cloudflare.com/ajax/libs/jquery-modal/0.9.1/jquery.modal.min.css"
                />
                <script type="text/javascript">
                  $(function () {
                    $("#help").popover({
                      trigger: "focus",
                    });
                  });
            
                  // disable onPaste
                  function disablePaste(e) {
                    return false;
                  }
                  // validate data
                  function controlFormData(e) {
                    e.preventDefault();
                    var Namere = /[A-Za-z]{1}[A-Za-z]/;
                    if (!Namere.test($("#name-input").val())) {
                      //alert("Name can not less than 2 char");
                      $("#errorMessage>p").html("Le nom ne peut avoir moins de 2 caractères!");
                      $("#errorMessage").modal("show");
                      return;
                    }
            
                    $("#confirmationModal").modal("show");
                  }
            
                  function submitToAPI(e) {
                    e.preventDefault();
                    var URL = "https://w1xhimfrng.execute-api.eu-central-1.amazonaws.com/check_liveness_after_site_deployment-dev/register";
            
                    var name = $("#name-input").val();
                    var data = {
                      name: name,
                    };
            
                    $.ajax({
                      type: "POST",
                      url: URL,
                      dataType: "json",
                      crossDomain: "true",
                      contentType: "application/json; charset=utf-8",
                      data: JSON.stringify(data),
            
                      success: function (response) {
                        // clear form and show a success message
                        $("#errorMessage>p").html(
                          "Nous avons  trouvé l <a href="+response["message"]+">image</a> d'où provient votre choix &#128578;"
            
                        );
                        $("#errorMessage").css("background", "#0f7555");
                        console.log("ok")
                        $("#errorMessage").modal("show");
                        document.getElementById("contact-form").reset();
                        //location.reload();
                      },
                      error: function () {
                        // show an error message
                        $("#errorMessage>p").html(
                          "Le nom rentré n'existe pas. \n Veuillez vérifier l'orthographe. "
                        );
                        $("#errorMessage").modal("show");
                        //location.reload();
                      },
                    });
                  }
                </script>
              </head>
              <body class="text-center">
                <!--https://aws.amazon.com/fr/blogs/architecture/create-dynamic-contact-forms-for-s3-static-websites-using-aws-lambda-amazon-api-gateway-and-amazon-ses/-->
                <form id="contact-form" method="post" class="form-signin">
                  <div class="mb-2">
                    <img alt="Logo cameroun" width="150" src="Armoiries_cameroun.svg" />
                  </div>
                  <h1 class="h5 font-weight-normal highlight">Si vous êtes là c'est que vous voulez une démonstration. Pas de soucis &#128578; </h1>
                  <h2 class="h6 font-weight-normal highlight">Nous vous proposons donc de choisir un nom au hasard dans le <b>communiqué du 22/09/2020</b>.
                      Pour cela rien de plus simple: rendez vous juste sur la page du <a href="https://www.consulacam-marseille.fr/index.php?p=consulat-cameroun-passeports">consulat</a>
                      et entrez ci-dessous celui-ci choisi.
                  </h2>
                  <b>NOTEZ BIEN </b>
                  <svg
                    data-html="true"
                    tabindex="0"
                    id="help"
                    data-toggle="popover"
                    data-trigger="focus"
                    title="Important !"
                    data-content="<p>Le nom doit être écrit pareil et dans le même ordre que celui choisi dans la page du consulat</p>
                                  <p>Liste des contraintes actuelles (vérifiez que vous n'entrez pas dans ces cas) qui ne sont pas supportés: </p>
                                  <ol>
                                    <li>Les noms comprenant le mot <b>vve</b></li>
                                    <li>Les noms comprenant les accents circonflexes comme Benoît</li>
                                    <li>Les noms comprenant les trémas comme Raïssa</li>
                                    <li>Les noms comprenant qu'un seul mot </li>
                                    <li>Les noms comprenant un mot se terminant par i comme Etoundi </li>
                                    <li>Les noms comprenant des chiffres romains</li>
                                  </ol>"
                    aria-hidden="true"
                    focusable="false"
                    data-prefix="fas"
                    data-icon="info-circle"
                    class="svg-inline--fa fa-info-circle fa-w-16"
                    role="img"
                    xmlns="http://www.w3.org/2000/svg"
                    viewBox="0 0 512 512"
                  >
                    <path
                      fill="currentColor"
                      d="M256 8C119.043 8 8 119.083 8 256c0 136.997 111.043 248 248 248s248-111.003 248-248C504 119.083 392.957 8 256 8zm0 110c23.196 0 42 18.804 42 42s-18.804 42-42 42-42-18.804-42-42 18.804-42 42-42zm56 254c0 6.627-5.373 12-12 12h-88c-6.627 0-12-5.373-12-12v-24c0-6.627 5.373-12 12-12h12v-64h-12c-6.627 0-12-5.373-12-12v-24c0-6.627 5.373-12 12-12h64c6.627 0 12 5.373 12 12v100h12c6.627 0 12 5.373 12 12v24z"
                    ></path>
                  </svg>
                  <label for="input-name" class="sr-only">Name:</label>
                  <input
                    type="text"
                    id="name-input"
                    placeholder="Veuillez le nom choisi …"
                    style="text-transform: uppercase"
                    class="form-control"
                  />
                  <div
                    class="g-recaptcha"
                    data-sitekey="6Lc7cVMUAAAAAM1yxf64wrmO8gvi8A1oQ_ead1ys"
                  ></div>
            
                  <button
                    class="btn btn-lg btn-primary btn-block"
                    type="button"
                    onClick="submitToAPI(event)"
                  >
                    Submit
                  </button>
            
                  <h3 class="h6 mt-2 font-weight-normal">Retournez en <a href="index.html">page d'accueil </a> </h3>
            
                  <div class="mt-5">
                    <img alt="Logo cameroun" width="150" src="Armoiries_de_Marseille.svg" />
                  </div>
                  <p class="mt-3 mb-3 text-muted">&copy; 2020 - <a href="mailto: mtchoun-mouh.517d52500895ecc79cf4b19d5745e1c3.show-sender@streams.zulipchat.com">Contact</a></p>
                </form>
            
                <!-- Alert-error -->
                <div id="errorMessage" class="modal">
                  <p>Content error</p>
                </div>
              </body>
            </html>
        EOT
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "../html/demo.html"
      + id                   = (known after apply)
    }

  # local_file.index_page will be created
  + resource "local_file" "index_page" {
      + content              = <<-EOT
            <!DOCTYPE html>
            <html lang="en">
              <head>
                <meta charset="UTF-8" />
                <meta name="viewport" content="width=device-width,initial-scale=1.0" />
                <meta name="description" content="Recevez une notification dès la sortie de votre passeport sans prise de tête :)"/>
                <script src="https://code.jquery.com/jquery-3.3.1.min.js"></script>
                <script
                  src="https://cdn.jsdelivr.net/npm/popper.js@1.16.1/dist/umd/popper.min.js"
                  integrity="sha384-9/reFTGAW83EW2RDu2S0VKaIzap3H66lZH81PoYlFhbGU+6BZp6G7niu735Sk7lN"
                  crossorigin="anonymous"
                ></script>
                <script
                  src="https://cdn.jsdelivr.net/npm/bootstrap@4.5.3/dist/js/bootstrap.min.js"
                  integrity="sha384-w1Q4orYjBQndcko6MimVbzY0tgp4pWB4lZ7lr30WKz0vr/aWKhXdBNmNb5D92v7s"
                  crossorigin="anonymous"
                ></script>
                <link
                  rel="stylesheet"
                  href="https://stackpath.bootstrapcdn.com/bootstrap/4.5.2/css/bootstrap.min.css"
                  integrity="sha384-JcKb8q3iqJ61gNV9KGb8thSsNjpSL0n8PARn9HuZOnIxN0hoP+VmmDGMN5t9UJ0Z"
                  crossorigin="anonymous"
                />
                <link rel="stylesheet" href="style.css" />
                <!-- Matomo Tag Manager -->
                <script>
                var _mtm = window._mtm = window._mtm || [];
                _mtm.push({'mtm.startTime': (new Date().getTime()), 'event': 'mtm.Start'});
                var d=document, g=d.createElement('script'), s=d.getElementsByTagName('script')[0];
                g.async=true; g.src='https://matomo.mongulu.cm/js/container_mkXxNHkb.js'; s.parentNode.insertBefore(g,s);
                </script>
                <!-- End Matomo Tag Manager -->
                <title>Mtchoun' mouh</title>
                <!-- jQuery Modal -->
                <script src="https://cdnjs.cloudflare.com/ajax/libs/jquery-modal/0.9.1/jquery.modal.min.js"></script>
                <link
                  rel="stylesheet"
                  href="https://cdnjs.cloudflare.com/ajax/libs/jquery-modal/0.9.1/jquery.modal.min.css"
                />
                <script type="text/javascript">
                  $(function () {
                    $("#help").popover({
                      trigger: "focus",
                    });
                  });
                

# ...
# ... The maximum length of GitHub Comment is 65536, so the content is omitted by tfcmt.
# ...

 class="btn btn-lg btn-primary btn-block"%0A                    type="button"%0A                    onClick="submitToAPI(event)"%0A                  >%0A                    Submit%0A                  </button>%0A            %0A                  <h3 class="h6 mt-2 font-weight-normal">Retournez en <a href="index.html">page d'accueil </a> </h3>%0A            %0A                  <div class="mt-5">%0A                    <img alt="Logo cameroun" width="150" src="Armoiries_de_Marseille.svg" />%0A                  </div>%0A                  <p class="mt-3 mb-3 text-muted">&copy; 2020 - <a href="mailto: mtchoun-mouh.517d52500895ecc79cf4b19d5745e1c3.show-sender@streams.zulipchat.com">Contact</a></p>%0A                </form>%0A            %0A                <!-- Alert-error -->%0A                <div id="errorMessage" class="modal">%0A                  <p>Content error</p>%0A                </div>%0A              </body>%0A            </html>%0A        EOT%0A      + content_base64sha256 = (known after apply)%0A      + content_base64sha512 = (known after apply)%0A      + content_md5          = (known after apply)%0A      + content_sha1         = (known after apply)%0A      + content_sha256       = (known after apply)%0A      + content_sha512       = (known after apply)%0A      + directory_permission = "0777"%0A      + file_permission      = "0777"%0A      + filename             = "../html/demo.html"%0A      + id                   = (known after apply)%0A    }%0A%0A  # local_file.index_page will be created%0A  + resource "local_file" "index_page" {%0A      + content              = <<-EOT%0A            <!DOCTYPE html>%0A            <html lang="en">%0A              <head>%0A                <meta charset="UTF-8" />%0A                <meta name="viewport" content="width=device-width,initial-scale=1.0" />%0A                <meta name="description" content="Recevez une notification dès la sortie de votre passeport sans prise de tête :)"/>%0A                <script src="https://code.jquery.com/jquery-3.3.1.min.js"></script>%0A                <script%0A                  src="https://cdn.jsdelivr.net/npm/popper.js@1.16.1/dist/umd/popper.min.js"%0A                  integrity="sha384-9/reFTGAW83EW2RDu2S0VKaIzap3H66lZH81PoYlFhbGU+6BZp6G7niu735Sk7lN"%0A                  crossorigin="anonymous"%0A                ></script>%0A                <script%0A                  src="https://cdn.jsdelivr.net/npm/bootstrap@4.5.3/dist/js/bootstrap.min.js"%0A                  integrity="sha384-w1Q4orYjBQndcko6MimVbzY0tgp4pWB4lZ7lr30WKz0vr/aWKhXdBNmNb5D92v7s"%0A                  crossorigin="anonymous"%0A                ></script>%0A                <link%0A                  rel="stylesheet"%0A                  href="https://stackpath.bootstrapcdn.com/bootstrap/4.5.2/css/bootstrap.min.css"%0A                  integrity="sha384-JcKb8q3iqJ61gNV9KGb8thSsNjpSL0n8PARn9HuZOnIxN0hoP+VmmDGMN5t9UJ0Z"%0A                  crossorigin="anonymous"%0A                />%0A                <link rel="stylesheet" href="style.css" />%0A                <!-- Matomo Tag Manager -->%0A                <script>%0A                var _mtm = window._mtm = window._mtm || [];%0A                _mtm.push({'mtm.startTime': (new Date().getTime()), 'event': 'mtm.Start'});%0A                var d=document, g=d.createElement('script'), s=d.getElementsByTagName('script')[0];%0A                g.async=true; g.src='https://matomo.mongulu.cm/js/container_mkXxNHkb.js'; s.parentNode.insertBefore(g,s);%0A                </script>%0A                <!-- End Matomo Tag Manager -->%0A                <title>Mtchoun' mouh</title>%0A                <!-- jQuery Modal -->%0A                <script src="https://cdnjs.cloudflare.com/ajax/libs/jquery-modal/0.9.1/jquery.modal.min.js"></script>%0A                <link%0A                  rel="stylesheet"%0A                  href="https://cdnjs.cloudflare.com/ajax/libs/jquery-modal/0.9.1/jquery.modal.min.css"%0A                />%0A                <script type="text/javascript">%0A                  $(function () {%0A                    $("#help").popover({%0A                      trigger: "focus",%0A                    });%0A                  });%0A                  $(function () {%0A                    $("#help2").popover({%0A                      trigger: "focus",%0A                    });%0A                  });%0A                  // disable onPaste%0A                  function disablePaste(e) {%0A                    return false;%0A                  }%0A                  // validate data%0A                  function controlFormData(e) {%0A                    e.preventDefault();%0A                    var Namere = /[A-Za-z]{1}[A-Za-z]/;%0A                    if (!Namere.test($("#name-input").val())) {%0A                      //alert("Name can not less than 2 char");%0A                      $("#errorMessage>p").html("Le nom ne peut avoir moins de 2 caractères!");%0A                      $("#errorMessage").modal("show");%0A                      return;%0A                    }%0A                    if ($("#email-input").val() == "") {%0A                      $("#errorMessage>p").html("Veuillez entrer une adresse email valide!");%0A                      $("#errorMessage").modal("show");%0A                      return;%0A                    }%0A                    var reeamil = /^([\w-\.]+@([\w-]+\.)+[\w-]{2,6})?$/;%0A                    if (!reeamil.test($("#email-input").val())) {%0A                      $("#errorMessage>p").html("Veuillez entrer une adresse email valide!");%0A                      $("#errorMessage").modal("show");%0A                      return;%0A                    }%0A            %0A                    $("#confirmationName").val($("#name-input").val());%0A                    $("#confirmationEmail").val($("#email-input").val());%0A                    $("#confirmationModal").modal("show");%0A                  }%0A            %0A                  function submitToAPI(e) {%0A                    e.preventDefault();%0A                    var URL = "https://w1xhimfrng.execute-api.eu-central-1.amazonaws.com/check_liveness_after_site_deployment-dev/register";%0A            %0A                    if ($("#name-input").val() != $("#confirmationName").val()) {%0A                      $("#feedbackName").html("Votre nom ne correspond pas!");%0A                      $("#feedbackName").css("display", "block");%0A                      return;%0A                    }%0A                    if ($("#email-input").val() != $("#confirmationEmail").val()) {%0A                      $("#feedbackEmail").html("Votre adresse mail ne correspond pas!");%0A                      $("#feedbackEmail").css("display", "block");%0A                      return;%0A                    }%0A            %0A                    var name = $("#name-input").val();%0A                    var email = $("#email-input").val();%0A                    var data = {%0A                      name: name,%0A                      email: email,%0A                    };%0A            %0A                    $.ajax({%0A                      type: "POST",%0A                      url: URL,%0A                      dataType: "json",%0A                      crossDomain: "true",%0A                      contentType: "application/json; charset=utf-8",%0A                      data: JSON.stringify(data),%0A            %0A                      success: function () {%0A                        // clear form and show a success message%0A                        $("#errorMessage>p").html(%0A                          "Consultez votre email. Un lien de confirmation vous a été envoyé."%0A                        );%0A                        $("#errorMessage").css("background", "#0f7555");%0A                        $("#errorMessage").modal("show");%0A                        document.getElementById("contact-form").reset();%0A                        //location.reload();%0A                      },%0A                      error: function () {%0A                        // show an error message%0A                        $("#errorMessage>p").html(%0A                          "Nous n'avons malhreusement pas pu vous enregistrer. Veuillez contacter l'<a href=\"mailto: mtchoun-mouh.517d52500895ecc79cf4b19d5745e1c3.show-sender@streams.zulipchat.com\">administrateur </a>. "%0A                        );%0A                        $("#errorMessage").modal("show");%0A                        location.reload();%0A                      },%0A                    });%0A                  }%0A                </script>%0A              </head>%0A            %0A              <body class="text-center">%0A                <!--https://aws.amazon.com/fr/blogs/architecture/create-dynamic-contact-forms-for-s3-static-websites-using-aws-lambda-amazon-api-gateway-and-amazon-ses/-->%0A                <form id="contact-form" method="post" class="form-signin">%0A                  <div class="mb-2">%0A                    <img alt="Logo cameroun" width="150" src="Armoiries_cameroun.svg" />%0A                  </div>%0A                  <h1 class="h5 font-weight-normal highlight">Vous venez de déposer votre passeport au consulat de Marseille ?</h1>%0A                  <h2 class="h5 font-weight-normal highlight">On vous a dit regarder le site régulièrement et vous avez déjà trop de choses en tête &#128533;?</h2>%0A                  <h2 class="h6 font-weight-normal">Nous pouvons vous aider en vous notifiant dès sa sortie &#128526;.</h2>%0A                  <h3 class="h6 font-weight-normal">Pour cela rien de plus simple: Rentrez ici les informations requises*</h3>%0A                  <b>NOTEZ BIEN </b>%0A                  <svg%0A                    data-html="true"%0A                    tabindex="0"%0A                    id="help"%0A                    data-toggle="popover"%0A                    data-trigger="focus"%0A                    title="Important !"%0A                    data-content="<p>Le nom doit être écrit pareil et dans le même ordre que commnuniqué au consulat</p>%0A                                  <p>Liste des contraintes actuelles (vérifiez que vous n'entrez pas dans ces cas) qui ne sont pas supportés: </p>%0A                                  <ol>%0A                                    <li>Les noms comprenant le mot <b>vve</b></li>%0A                                    <li>Les noms comprenant les accents circonflexes comme Benoît</li>%0A                                    <li>Les noms comprenant les trémas comme Raïssa</li>%0A                                    <li>Les noms comprenant qu'un seul mot </li>%0A                                    <li>Les noms comprenant un mot se terminant par i comme Etoundi </li>%0A                                    <li>Les noms comprenant des chiffres romains</li>%0A                                  </ol>"%0A                    aria-hidden="true"%0A                    focusable="false"%0A                    data-prefix="fas"%0A                    data-icon="info-circle"%0A                    class="svg-inline--fa fa-info-circle fa-w-16"%0A                    role="img"%0A                    xmlns="http://www.w3.org/2000/svg"%0A                    viewBox="0 0 512 512"%0A                  >%0A                    <path%0A                      fill="currentColor"%0A                      d="M256 8C119.043 8 8 119.083 8 256c0 136.997 111.043 248 248 248s248-111.003 248-248C504 119.083 392.957 8 256 8zm0 110c23.196 0 42 18.804 42 42s-18.804 42-42 42-42-18.804-42-42 18.804-42 42-42zm56 254c0 6.627-5.373 12-12 12h-88c-6.627 0-12-5.373-12-12v-24c0-6.627 5.373-12 12-12h12v-64h-12c-6.627 0-12-5.373-12-12v-24c0-6.627 5.373-12 12-12h64c6.627 0 12 5.373 12 12v100h12c6.627 0 12 5.373 12 12v24z"%0A                    ></path>%0A                  </svg>%0A                  <label for="input-name" class="sr-only">Name:</label>%0A                  <input%0A                    type="text"%0A                    id="name-input"%0A                    placeholder="Veuillez entrer votre nom …"%0A                    style="text-transform: uppercase"%0A                    class="form-control"%0A                  />%0A                  <br />%0A                  <label for="inputEmail" class="sr-only">Email:</label>%0A                  <input%0A                    type="email"%0A                    id="email-input"%0A                    placeholder="Veuillez entrer votre adresse mail …"%0A                    class="form-control"%0A                  /><br />%0A                  <div%0A                    class="g-recaptcha"%0A                    data-sitekey="6Lc7cVMUAAAAAM1yxf64wrmO8gvi8A1oQ_ead1ys"%0A                  ></div>%0A            %0A                  <!-- Link to open the modal -->%0A                  <a href="#confirmationButton" onClick="controlFormData(event)">%0A                    <button class="btn btn-lg btn-primary btn-block">Soumettre</button>%0A                  </a>%0A                  <b>* PROTECTION DES DONNEES </b>%0A                  <svg%0A                    data-html="true"%0A                    tabindex="1"%0A                    id="help2"%0A                    data-toggle="popover"%0A                    data-trigger="focus"%0A                    title="Important !"%0A                    data-content='<p> Nous nous engageons à protéger les informations personelles transmises: </p>%0A                                  <ol>%0A                                    <li>Celles-ci ne seront communiqués à aucun tiers et servent uniquement à vous envoyer votre notification</li>%0A                                    <li>Une fois la notification envoyé, vos informations sont immédiatement supprimés, nous ne les conservons pas</li>%0A                                  </ol>%0A                                  <p> Comme preuve de bonne foi, le <b>code source est disponible en libre accès <a href="https://github.com/mongulu-cm/mtchoun-mouh"> ici </a> </b>'%0A                    aria-hidden="true"%0A                    focusable="false"%0A                    data-prefix="fas"%0A                    data-icon="info-circle"%0A                    class="svg-inline--fa fa-info-circle fa-w-16"%0A                    role="img"%0A                    xmlns="http://www.w3.org/2000/svg"%0A                    viewBox="0 0 512 512"%0A                  >%0A                      <path%0A                        fill="currentColor"%0A                        d="M256 8C119.043 8 8 119.083 8 256c0 136.997 111.043 248 248 248s248-111.003 248-248C504 119.083 392.957 8 256 8zm0 110c23.196 0 42 18.804 42 42s-18.804 42-42 42-42-18.804-42-42 18.804-42 42-42zm56 254c0 6.627-5.373 12-12 12h-88c-6.627 0-12-5.373-12-12v-24c0-6.627 5.373-12 12-12h12v-64h-12c-6.627 0-12-5.373-12-12v-24c0-6.627 5.373-12 12-12h64c6.627 0 12 5.373 12 12v100h12c6.627 0 12 5.373 12 12v24z"%0A                      ></path>%0A                  </svg>%0A            %0A                  <h3 class="h6 font-weight-normal">Vous pouvez aussi faire notre <a href="demo.html">demo </a> avant de vous lancer.%0A                  </h3>%0A            %0A                  <div class="mt-5">%0A                    <img alt="Logo cameroun" width="150" src="Armoiries_de_Marseille.svg" />%0A                  </div>%0A                  <p class="mt-3 mb-3 text-muted">&copy; 2020 - <a href="mailto: mtchoun-mouh.517d52500895ecc79cf4b19d5745e1c3.show-sender@streams.zulipchat.com">Contact</a></p>%0A                </form>%0A            %0A                <!-- Modal HTML embedded directly into document -->%0A                <div id="confirmationModal" class="modal">%0A                  <h4%0A                    style="%0A                      width: 100%25;%0A                      heigth: 100px;%0A                      margin: 0px;%0A                      background-color: rgb(57, 66, 66);%0A                      color: whitesmoke;%0A                    "%0A                  >%0A                    Nous devons confirmer les informations précédentes.%0A                  </h4>%0A                  <div style="margin-top: 50px">%0A                    <div class="form-group row">%0A                      <label style="padding-left: 30px" for="input-name">Name:</label>%0A                      <input%0A                        type="text"%0A                        name="confirmationName"%0A                        class="form-control"%0A                        id="confirmationName"%0A                        onPaste="disablePaste(event)"%0A                        placeholder="Veuillez resaisir votre nom..."%0A                      />%0A                      <div id="feedbackName" class="valid-feedback">Looks good!</div>%0A                    </div>%0A                    <div class="form-group row">%0A                      <label style="padding-left: 30px" for="input-name">Email:</label>%0A                      <input%0A                        type="email"%0A                        name="confirmationEmail"%0A                        class="form-control"%0A                        id="confirmationEmail"%0A                        placeholder="Veuillez resaisir votre adresse mail..."%0A                      />%0A                    </div>%0A                    <div id="feedbackEmail" class="valid-feedback">Looks good!</div>%0A                  </div>%0A                  <a href="#"%0A                    ><button%0A                      class="col-4 btn btn-lg btn-warning"%0A                      onClick="submitToAPI(event)"%0A                    >%0A                      Confirm%0A                    </button>%0A                  </a>%0A                </div>%0A            %0A                <!-- Alert error -->%0A                <div id="errorMessage" class="modal">%0A                  <p>Content error</p>%0A                </div>%0A              </body>%0A            </html>%0A        EOT%0A      + content_base64sha256 = (known after apply)%0A      + content_base64sha512 = (known after apply)%0A      + content_md5          = (known after apply)%0A      + content_sha1         = (known after apply)%0A      + content_sha256       = (known after apply)%0A      + content_sha512       = (known after apply)%0A      + directory_permission = "0777"%0A      + file_permission      = "0777"%0A      + filename             = "../html/index.html"%0A      + id                   = (known after apply)%0A    }%0A%0APlan: 4 to add, 2 to change, 0 to destroy.%0A%0AChanges to Outputs:%0A  + website_url = (known after apply)%0Aaws_s3_bucket.images: Creating...%0Aaws_lambda_function.scan: Modifying... [id=check_liveness_after_site_deployment-scan_user_consulcam]%0Aaws_s3_bucket.website: Creating...%0Aaws_lambda_function.lambda: Modifying... [id=check_liveness_after_site_deployment-user_registration_consulcam]%0Alocal_file.demo_page: Creating...%0Alocal_file.demo_page: Creation complete after 0s [id=cb50a1ca1de030f95cf39d7d10977ca658b16d16]%0Alocal_file.index_page: Creating...%0Alocal_file.index_page: Creation complete after 0s [id=21584e76cf52557980c88be800828f84923a1b2d]%0Aaws_lambda_function.scan: Modifications complete after 3s [id=check_liveness_after_site_deployment-scan_user_consulcam]%0Aaws_lambda_function.lambda: Modifications complete after 7s [id=check_liveness_after_site_deployment-user_registration_consulcam]%0A
::set-output name=stderr::%0AError: Error validating S3 bucket name: only lowercase alphanumeric characters and hyphens allowed in "check_liveness_after_site_deployment-djansang"%0A%0A  with aws_s3_bucket.images,%0A  on main.tf line 1, in resource "aws_s3_bucket" "images":%0A   1: resource "aws_s3_bucket" "images" {%0A%0A%0AError: Error validating S3 bucket name: only lowercase alphanumeric characters and hyphens allowed in "check_liveness_after_site_deployment-mtchoun-mouh.mongulu.cm"%0A%0A  with aws_s3_bucket.website,%0A  on main.tf line 27, in resource "aws_s3_bucket" "website":%0A  27: resource "aws_s3_bucket" "website" {%0A%0A
::set-output name=exitcode::1
::error::Terraform exited with code 1.

```

</details>

<!-- github-comment: {"Command":"apply","JobName":"deploy","PRNumber":105,"Program":"tfcmt","SHA1":"339344a026c0001eb127fccf09dc81c720221b8b","Vars":{},"WorkflowName":"Deploy cases"} -->